RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0x14 : PDS_CTL3 */
#define PDS_CTL3_OFFSET                     (0x14)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF       PDS_CR_PDS_FORCE_MISC_PWR_OFF
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS   (1U)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN   (1U)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_MSK   (((1U << PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_UMSK  (~(((1U << PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS))
#define PDS_CR_PDS_FORCE_MISC_ISO_EN        PDS_CR_PDS_FORCE_MISC_ISO_EN
#define PDS_CR_PDS_FORCE_MISC_ISO_EN_POS    (4U)
#define PDS_CR_PDS_FORCE_MISC_ISO_EN_LEN    (1U)
#define PDS_CR_PDS_FORCE_MISC_ISO_EN_MSK    (((1U << PDS_CR_PDS_FORCE_MISC_ISO_EN_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_ISO_EN_POS)
#define PDS_CR_PDS_FORCE_MISC_ISO_EN_UMSK   (~(((1U << PDS_CR_PDS_FORCE_MISC_ISO_EN_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_ISO_EN_POS))
#define PDS_CR_PDS_FORCE_MISC_PDS_RST       PDS_CR_PDS_FORCE_MISC_PDS_RST
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_POS   (7U)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN   (1U)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_MSK   (((1U << PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_PDS_RST_POS)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_UMSK  (~(((1U << PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_PDS_RST_POS))
#define PDS_CR_PDS_FORCE_MISC_MEM_STBY      PDS_CR_PDS_FORCE_MISC_MEM_STBY
#define PDS_CR_PDS_FORCE_MISC_MEM_STBY_POS  (10U)
#define PDS_CR_PDS_FORCE_MISC_MEM_STBY_LEN  (1U)
#define PDS_CR_PDS_FORCE_MISC_MEM_STBY_MSK  (((1U << PDS_CR_PDS_FORCE_MISC_MEM_STBY_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_MEM_STBY_POS)
#define PDS_CR_PDS_FORCE_MISC_MEM_STBY_UMSK (~(((1U << PDS_CR_PDS_FORCE_MISC_MEM_STBY_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_MEM_STBY_POS))
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK      PDS_CR_PDS_FORCE_MISC_GATE_CLK
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS  (13U)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN  (1U)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_MSK  (((1U << PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_UMSK (~(((1U << PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN) - 1) << PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS))
#define PDS_CR_PDS_MM_ISO_EN                PDS_CR_PDS_MM_ISO_EN
#define PDS_CR_PDS_MM_ISO_EN_POS            (26U)
#define PDS_CR_PDS_MM_ISO_EN_LEN            (1U)
#define PDS_CR_PDS_MM_ISO_EN_MSK            (((1U << PDS_CR_PDS_MM_ISO_EN_LEN) - 1) << PDS_CR_PDS_MM_ISO_EN_POS)
#define PDS_CR_PDS_MM_ISO_EN_UMSK           (~(((1U << PDS_CR_PDS_MM_ISO_EN_LEN) - 1) << PDS_CR_PDS_MM_ISO_EN_POS))
#define PDS_CR_PDS_USB_ISO_EN               PDS_CR_PDS_USB_ISO_EN
#define PDS_CR_PDS_USB_ISO_EN_POS           (29U)
#define PDS_CR_PDS_USB_ISO_EN_LEN           (1U)
#define PDS_CR_PDS_USB_ISO_EN_MSK           (((1U << PDS_CR_PDS_USB_ISO_EN_LEN) - 1) << PDS_CR_PDS_USB_ISO_EN_POS)
#define PDS_CR_PDS_USB_ISO_EN_UMSK          (~(((1U << PDS_CR_PDS_USB_ISO_EN_LEN) - 1) << PDS_CR_PDS_USB_ISO_EN_POS))
#define PDS_CR_PDS_MISC_ISO_EN              PDS_CR_PDS_MISC_ISO_EN
#define PDS_CR_PDS_MISC_ISO_EN_POS          (30U)
#define PDS_CR_PDS_MISC_ISO_EN_LEN          (1U)
#define PDS_CR_PDS_MISC_ISO_EN_MSK          (((1U << PDS_CR_PDS_MISC_ISO_EN_LEN) - 1) << PDS_CR_PDS_MISC_ISO_EN_POS)
#define PDS_CR_PDS_MISC_ISO_EN_UMSK         (~(((1U << PDS_CR_PDS_MISC_ISO_EN_LEN) - 1) << PDS_CR_PDS_MISC_ISO_EN_POS))

/* 0x18 : PDS_CTL4 */
#define PDS_CTL4_OFFSET               (0x18)
#define PDS_CR_PDS_NP_RESET           PDS_CR_PDS_NP_RESET
#define PDS_CR_PDS_NP_RESET_POS       (1U)
#define PDS_CR_PDS_NP_RESET_LEN       (1U)
#define PDS_CR_PDS_NP_RESET_MSK       (((1U << PDS_CR_PDS_NP_RESET_LEN) - 1) << PDS_CR_PDS_NP_RESET_POS)
#define PDS_CR_PDS_NP_RESET_UMSK      (~(((1U << PDS_CR_PDS_NP_RESET_LEN) - 1) << PDS_CR_PDS_NP_RESET_POS))
#define PDS_CR_PDS_NP_MEM_STBY        PDS_CR_PDS_NP_MEM_STBY
#define PDS_CR_PDS_NP_MEM_STBY_POS    (2U)
#define PDS_CR_PDS_NP_MEM_STBY_LEN    (1U)
#define PDS_CR_PDS_NP_MEM_STBY_MSK    (((1U << PDS_CR_PDS_NP_MEM_STBY_LEN) - 1) << PDS_CR_PDS_NP_MEM_STBY_POS)
#define PDS_CR_PDS_NP_MEM_STBY_UMSK   (~(((1U << PDS_CR_PDS_NP_MEM_STBY_LEN) - 1) << PDS_CR_PDS_NP_MEM_STBY_POS))
#define PDS_CR_PDS_NP_GATE_CLK        PDS_CR_PDS_NP_GATE_CLK
#define PDS_CR_PDS_NP_GATE_CLK_POS    (3U)
#define PDS_CR_PDS_NP_GATE_CLK_LEN    (1U)
#define PDS_CR_PDS_NP_GATE_CLK_MSK    (((1U << PDS_CR_PDS_NP_GATE_CLK_LEN) - 1) << PDS_CR_PDS_NP_GATE_CLK_POS)
#define PDS_CR_PDS_NP_GATE_CLK_UMSK   (~(((1U << PDS_CR_PDS_NP_GATE_CLK_LEN) - 1) << PDS_CR_PDS_NP_GATE_CLK_POS))
#define PDS_CR_PDS_MM_PWR_OFF         PDS_CR_PDS_MM_PWR_OFF
#define PDS_CR_PDS_MM_PWR_OFF_POS     (8U)
#define PDS_CR_PDS_MM_PWR_OFF_LEN     (1U)
#define PDS_CR_PDS_MM_PWR_OFF_MSK     (((1U << PDS_CR_PDS_MM_PWR_OFF_LEN) - 1) << PDS_CR_PDS_MM_PWR_OFF_POS)
#define PDS_CR_PDS_MM_PWR_OFF_UMSK    (~(((1U << PDS_CR_PDS_MM_PWR_OFF_LEN) - 1) << PDS_CR_PDS_MM_PWR_OFF_POS))
#define PDS_CR_PDS_MM_RESET           PDS_CR_PDS_MM_RESET
#define PDS_CR_PDS_MM_RESET_POS       (9U)
#define PDS_CR_PDS_MM_RESET_LEN       (1U)
#define PDS_CR_PDS_MM_RESET_MSK       (((1U << PDS_CR_PDS_MM_RESET_LEN) - 1) << PDS_CR_PDS_MM_RESET_POS)
#define PDS_CR_PDS_MM_RESET_UMSK      (~(((1U << PDS_CR_PDS_MM_RESET_LEN) - 1) << PDS_CR_PDS_MM_RESET_POS))
#define PDS_CR_PDS_MM_MEM_STBY        PDS_CR_PDS_MM_MEM_STBY
#define PDS_CR_PDS_MM_MEM_STBY_POS    (10U)
#define PDS_CR_PDS_MM_MEM_STBY_LEN    (1U)
#define PDS_CR_PDS_MM_MEM_STBY_MSK    (((1U << PDS_CR_PDS_MM_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MM_MEM_STBY_POS)
#define PDS_CR_PDS_MM_MEM_STBY_UMSK   (~(((1U << PDS_CR_PDS_MM_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MM_MEM_STBY_POS))
#define PDS_CR_PDS_MM_GATE_CLK        PDS_CR_PDS_MM_GATE_CLK
#define PDS_CR_PDS_MM_GATE_CLK_POS    (11U)
#define PDS_CR_PDS_MM_GATE_CLK_LEN    (1U)
#define PDS_CR_PDS_MM_GATE_CLK_MSK    (((1U << PDS_CR_PDS_MM_GATE_CLK_LEN) - 1) << PDS_CR_PDS_MM_GATE_CLK_POS)
#define PDS_CR_PDS_MM_GATE_CLK_UMSK   (~(((1U << PDS_CR_PDS_MM_GATE_CLK_LEN) - 1) << PDS_CR_PDS_MM_GATE_CLK_POS))
#define PDS_CR_PDS_WB_RESET           PDS_CR_PDS_WB_RESET
#define PDS_CR_PDS_WB_RESET_POS       (13U)
#define PDS_CR_PDS_WB_RESET_LEN       (1U)
#define PDS_CR_PDS_WB_RESET_MSK       (((1U << PDS_CR_PDS_WB_RESET_LEN) - 1) << PDS_CR_PDS_WB_RESET_POS)
#define PDS_CR_PDS_WB_RESET_UMSK      (~(((1U << PDS_CR_PDS_WB_RESET_LEN) - 1) << PDS_CR_PDS_WB_RESET_POS))
#define PDS_CR_PDS_WB_MEM_STBY        PDS_CR_PDS_WB_MEM_STBY
#define PDS_CR_PDS_WB_MEM_STBY_POS    (14U)
#define PDS_CR_PDS_WB_MEM_STBY_LEN    (1U)
#define PDS_CR_PDS_WB_MEM_STBY_MSK    (((1U << PDS_CR_PDS_WB_MEM_STBY_LEN) - 1) << PDS_CR_PDS_WB_MEM_STBY_POS)
#define PDS_CR_PDS_WB_MEM_STBY_UMSK   (~(((1U << PDS_CR_PDS_WB_MEM_STBY_LEN) - 1) << PDS_CR_PDS_WB_MEM_STBY_POS))
#define PDS_CR_PDS_WB_GATE_CLK        PDS_CR_PDS_WB_GATE_CLK
#define PDS_CR_PDS_WB_GATE_CLK_POS    (15U)
#define PDS_CR_PDS_WB_GATE_CLK_LEN    (1U)
#define PDS_CR_PDS_WB_GATE_CLK_MSK    (((1U << PDS_CR_PDS_WB_GATE_CLK_LEN) - 1) << PDS_CR_PDS_WB_GATE_CLK_POS)
#define PDS_CR_PDS_WB_GATE_CLK_UMSK   (~(((1U << PDS_CR_PDS_WB_GATE_CLK_LEN) - 1) << PDS_CR_PDS_WB_GATE_CLK_POS))
#define PDS_CR_PDS_USB_PWR_OFF        PDS_CR_PDS_USB_PWR_OFF
#define PDS_CR_PDS_USB_PWR_OFF_POS    (20U)
#define PDS_CR_PDS_USB_PWR_OFF_LEN    (1U)
#define PDS_CR_PDS_USB_PWR_OFF_MSK    (((1U << PDS_CR_PDS_USB_PWR_OFF_LEN) - 1) << PDS_CR_PDS_USB_PWR_OFF_POS)
#define PDS_CR_PDS_USB_PWR_OFF_UMSK   (~(((1U << PDS_CR_PDS_USB_PWR_OFF_LEN) - 1) << PDS_CR_PDS_USB_PWR_OFF_POS))
#define PDS_CR_PDS_USB_RESET          PDS_CR_PDS_USB_RESET
#define PDS_CR_PDS_USB_RESET_POS      (21U)
#define PDS_CR_PDS_USB_RESET_LEN      (1U)
#define PDS_CR_PDS_USB_RESET_MSK      (((1U << PDS_CR_PDS_USB_RESET_LEN) - 1) << PDS_CR_PDS_USB_RESET_POS)
#define PDS_CR_PDS_USB_RESET_UMSK     (~(((1U << PDS_CR_PDS_USB_RESET_LEN) - 1) << PDS_CR_PDS_USB_RESET_POS))
#define PDS_CR_PDS_USB_MEM_STBY       PDS_CR_PDS_USB_MEM_STBY
#define PDS_CR_PDS_USB_MEM_STBY_POS   (22U)
#define PDS_CR_PDS_USB_MEM_STBY_LEN   (1U)
#define PDS_CR_PDS_USB_MEM_STBY_MSK   (((1U << PDS_CR_PDS_USB_MEM_STBY_LEN) - 1) << PDS_CR_PDS_USB_MEM_STBY_POS)
#define PDS_CR_PDS_USB_MEM_STBY_UMSK  (~(((1U << PDS_CR_PDS_USB_MEM_STBY_LEN) - 1) << PDS_CR_PDS_USB_MEM_STBY_POS))
#define PDS_CR_PDS_USB_GATE_CLK       PDS_CR_PDS_USB_GATE_CLK
#define PDS_CR_PDS_USB_GATE_CLK_POS   (23U)
#define PDS_CR_PDS_USB_GATE_CLK_LEN   (1U)
#define PDS_CR_PDS_USB_GATE_CLK_MSK   (((1U << PDS_CR_PDS_USB_GATE_CLK_LEN) - 1) << PDS_CR_PDS_USB_GATE_CLK_POS)
#define PDS_CR_PDS_USB_GATE_CLK_UMSK  (~(((1U << PDS_CR_PDS_USB_GATE_CLK_LEN) - 1) << PDS_CR_PDS_USB_GATE_CLK_POS))
#define PDS_CR_PDS_MISC_PWR_OFF       PDS_CR_PDS_MISC_PWR_OFF
#define PDS_CR_PDS_MISC_PWR_OFF_POS   (24U)
#define PDS_CR_PDS_MISC_PWR_OFF_LEN   (1U)
#define PDS_CR_PDS_MISC_PWR_OFF_MSK   (((1U << PDS_CR_PDS_MISC_PWR_OFF_LEN) - 1) << PDS_CR_PDS_MISC_PWR_OFF_POS)
#define PDS_CR_PDS_MISC_PWR_OFF_UMSK  (~(((1U << PDS_CR_PDS_MISC_PWR_OFF_LEN) - 1) << PDS_CR_PDS_MISC_PWR_OFF_POS))
#define PDS_CR_PDS_MISC_RESET         PDS_CR_PDS_MISC_RESET
#define PDS_CR_PDS_MISC_RESET_POS     (25U)
#define PDS_CR_PDS_MISC_RESET_LEN     (1U)
#define PDS_CR_PDS_MISC_RESET_MSK     (((1U << PDS_CR_PDS_MISC_RESET_LEN) - 1) << PDS_CR_PDS_MISC_RESET_POS)
#define PDS_CR_PDS_MISC_RESET_UMSK    (~(((1U << PDS_CR_PDS_MISC_RESET_LEN) - 1) << PDS_CR_PDS_MISC_RESET_POS))
#define PDS_CR_PDS_MISC_MEM_STBY      PDS_CR_PDS_MISC_MEM_STBY
#define PDS_CR_PDS_MISC_MEM_STBY_POS  (26U)
#define PDS_CR_PDS_MISC_MEM_STBY_LEN  (1U)
#define PDS_CR_PDS_MISC_MEM_STBY_MSK  (((1U << PDS_CR_PDS_MISC_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MISC_MEM_STBY_POS)
#define PDS_CR_PDS_MISC_MEM_STBY_UMSK (~(((1U << PDS_CR_PDS_MISC_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MISC_MEM_STBY_POS))
#define PDS_CR_PDS_MISC_GATE_CLK      PDS_CR_PDS_MISC_GATE_CLK
#define PDS_CR_PDS_MISC_GATE_CLK_POS  (27U)
#define PDS_CR_PDS_MISC_GATE_CLK_LEN  (1U)
#define PDS_CR_PDS_MISC_GATE_CLK_MSK  (((1U << PDS_CR_PDS_MISC_GATE_CLK_LEN) - 1) << PDS_CR_PDS_MISC_GATE_CLK_POS)
#define PDS_CR_PDS_MISC_GATE_CLK_UMSK (~(((1U << PDS_CR_PDS_MISC_GATE_CLK_LEN) - 1) << PDS_CR_PDS_MISC_GATE_CLK_POS))

/* 0x1C : pds_stat */
#define PDS_STAT_OFFSET          (0x1C)
#define PDS_RO_PDS_STATE         PDS_RO_PDS_STATE
#define PDS_RO_PDS_STATE_POS     (0U)
#define PDS_RO_PDS_STATE_LEN     (5U)
#define PDS_RO_PDS_STATE_MSK     (((1U << PDS_RO_PDS_STATE_LEN) - 1) << PDS_RO_PDS_STATE_POS)
#define PDS_RO_PDS_STATE_UMSK    (~(((1U << PDS_RO_PDS_STATE_LEN) - 1) << PDS_RO_PDS_STATE_POS))
#define PDS_RO_PDS_RF_STATE      PDS_RO_PDS_RF_STATE
#define PDS_RO_PDS_RF_STATE_POS  (8U)
#define PDS_RO_PDS_RF_STATE_LEN  (5U)
#define PDS_RO_PDS_RF_STATE_MSK  (((1U << PDS_RO_PDS_RF_STATE_LEN) - 1) << PDS_RO_PDS_RF_STATE_POS)
#define PDS_RO_PDS_RF_STATE_UMSK (~(((1U << PDS_RO_PDS_RF_STATE_LEN) - 1) << PDS_RO_PDS_RF_STATE_POS))
#define PDS_RESET_EVENT          PDS_RESET_EVENT
#define PDS_RESET_EVENT_POS      (24U)
#define PDS_RESET_EVENT_LEN      (3U)
#define PDS_RESET_EVENT_MSK      (((1U << PDS_RESET_EVENT_LEN) - 1) << PDS_RESET_EVENT_POS)
#define PDS_RESET_EVENT_UMSK     (~(((1U << PDS_RESET_EVENT_LEN) - 1) << PDS_RESET_EVENT_POS))
#define PDS_CLR_RESET_EVENT      PDS_CLR_RESET_EVENT
#define PDS_CLR_RESET_EVENT_POS  (31U)
#define PDS_CLR_RESET_EVENT_LEN  (1U)
#define PDS_CLR_RESET_EVENT_MSK  (((1U << PDS_CLR_RESET_EVENT_LEN) - 1) << PDS_CLR_RESET_EVENT_POS)
#define PDS_CLR_RESET_EVENT_UMSK (~(((1U << PDS_CLR_RESET_EVENT_LEN) - 1) << PDS_CLR_RESET_EVENT_POS))

/* 0x20 : pds_ram1 */
#define PDS_RAM1_OFFSET                   (0x20)
#define PDS_CR_OCRAM_SLP                  PDS_CR_OCRAM_SLP
#define PDS_CR_OCRAM_SLP_POS              (0U)
#define PDS_CR_OCRAM_SLP_LEN              (4U)
#define PDS_CR_OCRAM_SLP_MSK              (((1U << PDS_CR_OCRAM_SLP_LEN) - 1) << PDS_CR_OCRAM_SLP_POS)
#define PDS_CR_OCRAM_SLP_UMSK             (~(((1U << PDS_CR_OCRAM_SLP_LEN) - 1) << PDS_CR_OCRAM_SLP_POS))
#define PDS_CR_OCRAM_RET                  PDS_CR_OCRAM_RET
#define PDS_CR_OCRAM_RET_POS              (4U)
#define PDS_CR_OCRAM_RET_LEN              (4U)
#define PDS_CR_OCRAM_RET_MSK              (((1U << PDS_CR_OCRAM_RET_LEN) - 1) << PDS_CR_OCRAM_RET_POS)
#define PDS_CR_OCRAM_RET_UMSK             (~(((1U << PDS_CR_OCRAM_RET_LEN) - 1) << PDS_CR_OCRAM_RET_POS))
#define PDS_CR_PDS_RAM_CLK_CNT            PDS_CR_PDS_RAM_CLK_CNT
#define PDS_CR_PDS_RAM_CLK_CNT_POS        (8U)
#define PDS_CR_PDS_RAM_CLK_CNT_LEN        (6U)
#define PDS_CR_PDS_RAM_CLK_CNT_MSK        (((1U << PDS_CR_PDS_RAM_CLK_CNT_LEN) - 1) << PDS_CR_PDS_RAM_CLK_CNT_POS)
#define PDS_CR_PDS_RAM_CLK_CNT_UMSK       (~(((1U << PDS_CR_PDS_RAM_CLK_CNT_LEN) - 1) << PDS_CR_PDS_RAM_CLK_CNT_POS))
#define PDS_CR_PDS_RAM_CLK2_CNT           PDS_CR_PDS_RAM_CLK2_CNT
#define PDS_CR_PDS_RAM_CLK2_CNT_POS       (16U)
#define PDS_CR_PDS_RAM_CLK2_CNT_LEN       (6U)
#define PDS_CR_PDS_RAM_CLK2_CNT_MSK       (((1U << PDS_CR_PDS_RAM_CLK2_CNT_LEN) - 1) << PDS_CR_PDS_RAM_CLK2_CNT_POS)
#define PDS_CR_PDS_RAM_CLK2_CNT_UMSK      (~(((1U << PDS_CR_PDS_RAM_CLK2_CNT_LEN) - 1) << PDS_CR_PDS_RAM_CLK2_CNT_POS))
#define PDS_CR_PDS_CTRL_NP_RAM_CLK        PDS_CR_PDS_CTRL_NP_RAM_CLK
#define PDS_CR_PDS_CTRL_NP_RAM_CLK_POS    (24U)
#define PDS_CR_PDS_CTRL_NP_RAM_CLK_LEN    (1U)
#define PDS_CR_PDS_CTRL_NP_RAM_CLK_MSK    (((1U << PDS_CR_PDS_CTRL_NP_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_NP_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_NP_RAM_CLK_UMSK   (~(((1U << PDS_CR_PDS_CTRL_NP_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_NP_RAM_CLK_POS))
#define PDS_CR_PDS_CTRL_MM_RAM_CLK        PDS_CR_PDS_CTRL_MM_RAM_CLK
#define PDS_CR_PDS_CTRL_MM_RAM_CLK_POS    (25U)
#define PDS_CR_PDS_CTRL_MM_RAM_CLK_LEN    (1U)
#define PDS_CR_PDS_CTRL_MM_RAM_CLK_MSK    (((1U << PDS_CR_PDS_CTRL_MM_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_MM_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_MM_RAM_CLK_UMSK   (~(((1U << PDS_CR_PDS_CTRL_MM_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_MM_RAM_CLK_POS))
#define PDS_CR_PDS_CTRL_WB_RAM_CLK        PDS_CR_PDS_CTRL_WB_RAM_CLK
#define PDS_CR_PDS_CTRL_WB_RAM_CLK_POS    (26U)
#define PDS_CR_PDS_CTRL_WB_RAM_CLK_LEN    (1U)
#define PDS_CR_PDS_CTRL_WB_RAM_CLK_MSK    (((1U << PDS_CR_PDS_CTRL_WB_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_WB_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_WB_RAM_CLK_UMSK   (~(((1U << PDS_CR_PDS_CTRL_WB_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_WB_RAM_CLK_POS))
#define PDS_CR_PDS_CTRL_USB_RAM_CLK       PDS_CR_PDS_CTRL_USB_RAM_CLK
#define PDS_CR_PDS_CTRL_USB_RAM_CLK_POS   (27U)
#define PDS_CR_PDS_CTRL_USB_RAM_CLK_LEN   (1U)
#define PDS_CR_PDS_CTRL_USB_RAM_CLK_MSK   (((1U << PDS_CR_PDS_CTRL_USB_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_USB_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_USB_RAM_CLK_UMSK  (~(((1U << PDS_CR_PDS_CTRL_USB_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_USB_RAM_CLK_POS))
#define PDS_CR_PDS_CTRL_MISC_RAM_CLK      PDS_CR_PDS_CTRL_MISC_RAM_CLK
#define PDS_CR_PDS_CTRL_MISC_RAM_CLK_POS  (28U)
#define PDS_CR_PDS_CTRL_MISC_RAM_CLK_LEN  (1U)
#define PDS_CR_PDS_CTRL_MISC_RAM_CLK_MSK  (((1U << PDS_CR_PDS_CTRL_MISC_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_MISC_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_MISC_RAM_CLK_UMSK (~(((1U << PDS_CR_PDS_CTRL_MISC_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_MISC_RAM_CLK_POS))
#define PDS_CR_PDS_CTRL_RAM_CLK2          PDS_CR_PDS_CTRL_RAM_CLK2
#define PDS_CR_PDS_CTRL_RAM_CLK2_POS      (30U)
#define PDS_CR_PDS_CTRL_RAM_CLK2_LEN      (1U)
#define PDS_CR_PDS_CTRL_RAM_CLK2_MSK      (((1U << PDS_CR_PDS_CTRL_RAM_CLK2_LEN) - 1) << PDS_CR_PDS_CTRL_RAM_CLK2_POS)
#define PDS_CR_PDS_CTRL_RAM_CLK2_UMSK     (~(((1U << PDS_CR_PDS_CTRL_RAM_CLK2_LEN) - 1) << PDS_CR_PDS_CTRL_RAM_CLK2_POS))
#define PDS_CR_PDS_CTRL_RAM_CLK           PDS_CR_PDS_CTRL_RAM_CLK
#define PDS_CR_PDS_CTRL_RAM_CLK_POS       (31U)
#define PDS_CR_PDS_CTRL_RAM_CLK_LEN       (1U)
#define PDS_CR_PDS_CTRL_RAM_CLK_MSK       (((1U << PDS_CR_PDS_CTRL_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_RAM_CLK_POS)
#define PDS_CR_PDS_CTRL_RAM_CLK_UMSK      (~(((1U << PDS_CR_PDS_CTRL_RAM_CLK_LEN) - 1) << PDS_CR_PDS_CTRL_RAM_CLK_POS))

/* 0x24 : PDS_CTL5 */
#define PDS_CTL5_OFFSET              (0x24)
#define PDS_CR_NP_WFI_MASK           PDS_CR_NP_WFI_MASK
#define PDS_CR_NP_WFI_MASK_POS       (0U)
#define PDS_CR_NP_WFI_MASK_LEN       (1U)
#define PDS_CR_NP_WFI_MASK_MSK       (((1U << PDS_CR_NP_WFI_MASK_LEN) - 1) << PDS_CR_NP_WFI_MASK_POS)
#define PDS_CR_NP_WFI_MASK_UMSK      (~(((1U << PDS_CR_NP_WFI_MASK_LEN) - 1) << PDS_CR_NP_WFI_MASK_POS))
#define PDS_CR_MM_WFI_MASK           PDS_CR_MM_WFI_MASK
#define PDS_CR_MM_WFI_MASK_POS       (2U)
#define PDS_CR_MM_WFI_MASK_LEN       (1U)
#define PDS_CR_MM_WFI_MASK_MSK       (((1U << PDS_CR_MM_WFI_MASK_LEN) - 1) << PDS_CR_MM_WFI_MASK_POS)
#define PDS_CR_MM_WFI_MASK_UMSK      (~(((1U << PDS_CR_MM_WFI_MASK_LEN) - 1) << PDS_CR_MM_WFI_MASK_POS))
#define PDS_CR_PICO_WFI_MASK         PDS_CR_PICO_WFI_MASK
#define PDS_CR_PICO_WFI_MASK_POS     (4U)
#define PDS_CR_PICO_WFI_MASK_LEN     (1U)
#define PDS_CR_PICO_WFI_MASK_MSK     (((1U << PDS_CR_PICO_WFI_MASK_LEN) - 1) << PDS_CR_PICO_WFI_MASK_POS)
#define PDS_CR_PICO_WFI_MASK_UMSK    (~(((1U << PDS_CR_PICO_WFI_MASK_LEN) - 1) << PDS_CR_PICO_WFI_MASK_POS))
#define PDS_CR_PDS_CTRL_USB33        PDS_CR_PDS_CTRL_USB33
#define PDS_CR_PDS_CTRL_USB33_POS    (8U)
#define PDS_CR_PDS_CTRL_USB33_LEN    (1U)
#define PDS_CR_PDS_CTRL_USB33_MSK    (((1U << PDS_CR_PDS_CTRL_USB33_LEN) - 1) << PDS_CR_PDS_CTRL_USB33_POS)
#define PDS_CR_PDS_CTRL_USB33_UMSK   (~(((1U << PDS_CR_PDS_CTRL_USB33_LEN) - 1) << PDS_CR_PDS_CTRL_USB33_POS))
#define PDS_CR_PDS_PD_LDO18IO        PDS_CR_PDS_PD_LDO18IO
#define PDS_CR_PDS_PD_LDO18IO_POS    (9U)
#define PDS_CR_PDS_PD_LDO18IO_LEN    (1U)
#define PDS_CR_PDS_PD_LDO18IO_MSK    (((1U << PDS_CR_PDS_PD_LDO18IO_LEN) - 1) << PDS_CR_PDS_PD_LDO18IO_POS)
#define PDS_CR_PDS_PD_LDO18IO_UMSK   (~(((1U << PDS_CR_PDS_PD_LDO18IO_LEN) - 1) << PDS_CR_PDS_PD_LDO18IO_POS))
#define PDS_CR_PDS_GPIO_KEEP_EN      PDS_CR_PDS_GPIO_KEEP_EN
#define PDS_CR_PDS_GPIO_KEEP_EN_POS  (16U)
#define PDS_CR_PDS_GPIO_KEEP_EN_LEN  (3U)
#define PDS_CR_PDS_GPIO_KEEP_EN_MSK  (((1U << PDS_CR_PDS_GPIO_KEEP_EN_LEN) - 1) << PDS_CR_PDS_GPIO_KEEP_EN_POS)
#define PDS_CR_PDS_GPIO_KEEP_EN_UMSK (~(((1U << PDS_CR_PDS_GPIO_KEEP_EN_LEN) - 1) << PDS_CR_PDS_GPIO_KEEP_EN_POS))

/* 0x28 : PDS_RAM2 */
#define PDS_RAM2_OFFSET      (0x28)
#define PDS_CR_WRAM_SLP      PDS_CR_WRAM_SLP
#define PDS_CR_WRAM_SLP_POS  (0U)
#define PDS_CR_WRAM_SLP_LEN  (10U)
#define PDS_CR_WRAM_SLP_MSK  (((1U << PDS_CR_WRAM_SLP_LEN) - 1) << PDS_CR_WRAM_SLP_POS)
#define PDS_CR_WRAM_SLP_UMSK (~(((1U << PDS_CR_WRAM_SLP_LEN) - 1) << PDS_CR_WRAM_SLP_POS))
#define PDS_CR_WRAM_RET      PDS_CR_WRAM_RET
#define PDS_CR_WRAM_RET_POS  (10U)
#define PDS_CR_WRAM_RET_LEN  (10U)
#define PDS_CR_WRAM_RET_MSK  (((1U << PDS_CR_WRAM_RET_LEN) - 1) << PDS_CR_WRAM_RET_POS)
#define PDS_CR_WRAM_RET_UMSK (~(((1U << PDS_CR_WRAM_RET_LEN) - 1) << PDS_CR_WRAM_RET_POS))

/* 0x30 : pds_gpio_i_set */
#define PDS_GPIO_I_SET_OFFSET       (0x30)
#define PDS_CR_PDS_GPIO_IE_SET      PDS_CR_PDS_GPIO_IE_SET
#define PDS_CR_PDS_GPIO_IE_SET_POS  (0U)
#define PDS_CR_PDS_GPIO_IE_SET_LEN  (3U)
#define PDS_CR_PDS_GPIO_IE_SET_MSK  (((1U << PDS_CR_PDS_GPIO_IE_SET_LEN) - 1) << PDS_CR_PDS_GPIO_IE_SET_POS)
#define PDS_CR_PDS_GPIO_IE_SET_UMSK (~(((1U << PDS_CR_PDS_GPIO_IE_SET_LEN) - 1) << PDS_CR_PDS_GPIO_IE_SET_POS))
#define PDS_CR_PDS_GPIO_PD_SET      PDS_CR_PDS_GPIO_PD_SET
#define PDS_CR_PDS_GPIO_PD_SET_POS  (3U)
#define PDS_CR_PDS_GPIO_PD_SET_LEN  (3U)
#define PDS_CR_PDS_GPIO_PD_SET_MSK  (((1U << PDS_CR_PDS_GPIO_PD_SET_LEN) - 1) << PDS_CR_PDS_GPIO_PD_SET_POS)
#define PDS_CR_PDS_GPIO_PD_SET_UMSK (~(((1U << PDS_CR_PDS_GPIO_PD_SET_LEN) - 1) << PDS_CR_PDS_GPIO_PD_SET_POS))
#define PDS_CR_PDS_GPIO_PU_SET      PDS_CR_PDS_GPIO_PU_SET
#define PDS_CR_PDS_GPIO_PU_SET_POS  (6U)
#define PDS_CR_PDS_GPIO_PU_SET_LEN  (3U)
#define PDS_CR_PDS_GPIO_PU_SET_MSK  (((1U << PDS_CR_PDS_GPIO_PU_SET_LEN) - 1) << PDS_CR_PDS_GPIO_PU_SET_POS)
#define PDS_CR_PDS_GPIO_PU_SET_UMSK (~(((1U << PDS_CR_PDS_GPIO_PU_SET_LEN) - 1) << PDS_CR_PDS_GPIO_PU_SET_POS))

