RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0x34 : pds_gpio_pd_set */
#define PDS_GPIO_PD_SET_OFFSET            (0x34)
#define PDS_CR_PDS_GPIO_SET_INT_MASK      PDS_CR_PDS_GPIO_SET_INT_MASK
#define PDS_CR_PDS_GPIO_SET_INT_MASK_POS  (0U)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_LEN  (32U)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_MSK  (((1U << PDS_CR_PDS_GPIO_SET_INT_MASK_LEN) - 1) << PDS_CR_PDS_GPIO_SET_INT_MASK_POS)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_UMSK (~(((1U << PDS_CR_PDS_GPIO_SET_INT_MASK_LEN) - 1) << PDS_CR_PDS_GPIO_SET_INT_MASK_POS))

/* 0x40 : pds_gpio_int */
#define PDS_GPIO_INT_OFFSET         (0x40)
#define PDS_GPIO_SET1_INT_CLR       PDS_GPIO_SET1_INT_CLR
#define PDS_GPIO_SET1_INT_CLR_POS   (2U)
#define PDS_GPIO_SET1_INT_CLR_LEN   (1U)
#define PDS_GPIO_SET1_INT_CLR_MSK   (((1U << PDS_GPIO_SET1_INT_CLR_LEN) - 1) << PDS_GPIO_SET1_INT_CLR_POS)
#define PDS_GPIO_SET1_INT_CLR_UMSK  (~(((1U << PDS_GPIO_SET1_INT_CLR_LEN) - 1) << PDS_GPIO_SET1_INT_CLR_POS))
#define PDS_GPIO_SET1_INT_MODE      PDS_GPIO_SET1_INT_MODE
#define PDS_GPIO_SET1_INT_MODE_POS  (4U)
#define PDS_GPIO_SET1_INT_MODE_LEN  (4U)
#define PDS_GPIO_SET1_INT_MODE_MSK  (((1U << PDS_GPIO_SET1_INT_MODE_LEN) - 1) << PDS_GPIO_SET1_INT_MODE_POS)
#define PDS_GPIO_SET1_INT_MODE_UMSK (~(((1U << PDS_GPIO_SET1_INT_MODE_LEN) - 1) << PDS_GPIO_SET1_INT_MODE_POS))
#define PDS_GPIO_SET2_INT_CLR       PDS_GPIO_SET2_INT_CLR
#define PDS_GPIO_SET2_INT_CLR_POS   (10U)
#define PDS_GPIO_SET2_INT_CLR_LEN   (1U)
#define PDS_GPIO_SET2_INT_CLR_MSK   (((1U << PDS_GPIO_SET2_INT_CLR_LEN) - 1) << PDS_GPIO_SET2_INT_CLR_POS)
#define PDS_GPIO_SET2_INT_CLR_UMSK  (~(((1U << PDS_GPIO_SET2_INT_CLR_LEN) - 1) << PDS_GPIO_SET2_INT_CLR_POS))
#define PDS_GPIO_SET2_INT_MODE      PDS_GPIO_SET2_INT_MODE
#define PDS_GPIO_SET2_INT_MODE_POS  (12U)
#define PDS_GPIO_SET2_INT_MODE_LEN  (4U)
#define PDS_GPIO_SET2_INT_MODE_MSK  (((1U << PDS_GPIO_SET2_INT_MODE_LEN) - 1) << PDS_GPIO_SET2_INT_MODE_POS)
#define PDS_GPIO_SET2_INT_MODE_UMSK (~(((1U << PDS_GPIO_SET2_INT_MODE_LEN) - 1) << PDS_GPIO_SET2_INT_MODE_POS))
#define PDS_GPIO_SET3_INT_CLR       PDS_GPIO_SET3_INT_CLR
#define PDS_GPIO_SET3_INT_CLR_POS   (18U)
#define PDS_GPIO_SET3_INT_CLR_LEN   (1U)
#define PDS_GPIO_SET3_INT_CLR_MSK   (((1U << PDS_GPIO_SET3_INT_CLR_LEN) - 1) << PDS_GPIO_SET3_INT_CLR_POS)
#define PDS_GPIO_SET3_INT_CLR_UMSK  (~(((1U << PDS_GPIO_SET3_INT_CLR_LEN) - 1) << PDS_GPIO_SET3_INT_CLR_POS))
#define PDS_GPIO_SET3_INT_MODE      PDS_GPIO_SET3_INT_MODE
#define PDS_GPIO_SET3_INT_MODE_POS  (20U)
#define PDS_GPIO_SET3_INT_MODE_LEN  (4U)
#define PDS_GPIO_SET3_INT_MODE_MSK  (((1U << PDS_GPIO_SET3_INT_MODE_LEN) - 1) << PDS_GPIO_SET3_INT_MODE_POS)
#define PDS_GPIO_SET3_INT_MODE_UMSK (~(((1U << PDS_GPIO_SET3_INT_MODE_LEN) - 1) << PDS_GPIO_SET3_INT_MODE_POS))
#define PDS_GPIO_SET4_INT_CLR       PDS_GPIO_SET4_INT_CLR
#define PDS_GPIO_SET4_INT_CLR_POS   (26U)
#define PDS_GPIO_SET4_INT_CLR_LEN   (1U)
#define PDS_GPIO_SET4_INT_CLR_MSK   (((1U << PDS_GPIO_SET4_INT_CLR_LEN) - 1) << PDS_GPIO_SET4_INT_CLR_POS)
#define PDS_GPIO_SET4_INT_CLR_UMSK  (~(((1U << PDS_GPIO_SET4_INT_CLR_LEN) - 1) << PDS_GPIO_SET4_INT_CLR_POS))
#define PDS_GPIO_SET4_INT_MODE      PDS_GPIO_SET4_INT_MODE
#define PDS_GPIO_SET4_INT_MODE_POS  (28U)
#define PDS_GPIO_SET4_INT_MODE_LEN  (4U)
#define PDS_GPIO_SET4_INT_MODE_MSK  (((1U << PDS_GPIO_SET4_INT_MODE_LEN) - 1) << PDS_GPIO_SET4_INT_MODE_POS)
#define PDS_GPIO_SET4_INT_MODE_UMSK (~(((1U << PDS_GPIO_SET4_INT_MODE_LEN) - 1) << PDS_GPIO_SET4_INT_MODE_POS))

/* 0x44 : pds_gpio_stat */
#define PDS_GPIO_STAT_OFFSET   (0x44)
#define PDS_GPIO_INT_STAT      PDS_GPIO_INT_STAT
#define PDS_GPIO_INT_STAT_POS  (0U)
#define PDS_GPIO_INT_STAT_LEN  (32U)
#define PDS_GPIO_INT_STAT_MSK  (((1U << PDS_GPIO_INT_STAT_LEN) - 1) << PDS_GPIO_INT_STAT_POS)
#define PDS_GPIO_INT_STAT_UMSK (~(((1U << PDS_GPIO_INT_STAT_LEN) - 1) << PDS_GPIO_INT_STAT_POS))

/* 0x110 : cpu_core_cfg0 */
#define PDS_CPU_CORE_CFG0_OFFSET (0x110)
#define PDS_REG_PICO_CLK_EN      PDS_REG_PICO_CLK_EN
#define PDS_REG_PICO_CLK_EN_POS  (28U)
#define PDS_REG_PICO_CLK_EN_LEN  (1U)
#define PDS_REG_PICO_CLK_EN_MSK  (((1U << PDS_REG_PICO_CLK_EN_LEN) - 1) << PDS_REG_PICO_CLK_EN_POS)
#define PDS_REG_PICO_CLK_EN_UMSK (~(((1U << PDS_REG_PICO_CLK_EN_LEN) - 1) << PDS_REG_PICO_CLK_EN_POS))
#define PDS_E902_DFS_REQ         PDS_E902_DFS_REQ
#define PDS_E902_DFS_REQ_POS     (29U)
#define PDS_E902_DFS_REQ_LEN     (1U)
#define PDS_E902_DFS_REQ_MSK     (((1U << PDS_E902_DFS_REQ_LEN) - 1) << PDS_E902_DFS_REQ_POS)
#define PDS_E902_DFS_REQ_UMSK    (~(((1U << PDS_E902_DFS_REQ_LEN) - 1) << PDS_E902_DFS_REQ_POS))
#define PDS_E902_DFS_ACK         PDS_E902_DFS_ACK
#define PDS_E902_DFS_ACK_POS     (30U)
#define PDS_E902_DFS_ACK_LEN     (1U)
#define PDS_E902_DFS_ACK_MSK     (((1U << PDS_E902_DFS_ACK_LEN) - 1) << PDS_E902_DFS_ACK_POS)
#define PDS_E902_DFS_ACK_UMSK    (~(((1U << PDS_E902_DFS_ACK_LEN) - 1) << PDS_E902_DFS_ACK_POS))

/* 0x114 : cpu_core_cfg1 */
#define PDS_CPU_CORE_CFG1_OFFSET (0x114)
#define PDS_REG_PLL_SEL          PDS_REG_PLL_SEL
#define PDS_REG_PLL_SEL_POS      (4U)
#define PDS_REG_PLL_SEL_LEN      (2U)
#define PDS_REG_PLL_SEL_MSK      (((1U << PDS_REG_PLL_SEL_LEN) - 1) << PDS_REG_PLL_SEL_POS)
#define PDS_REG_PLL_SEL_UMSK     (~(((1U << PDS_REG_PLL_SEL_LEN) - 1) << PDS_REG_PLL_SEL_POS))
#define PDS_REG_MCU1_CLK_EN      PDS_REG_MCU1_CLK_EN
#define PDS_REG_MCU1_CLK_EN_POS  (8U)
#define PDS_REG_MCU1_CLK_EN_LEN  (1U)
#define PDS_REG_MCU1_CLK_EN_MSK  (((1U << PDS_REG_MCU1_CLK_EN_LEN) - 1) << PDS_REG_MCU1_CLK_EN_POS)
#define PDS_REG_MCU1_CLK_EN_UMSK (~(((1U << PDS_REG_MCU1_CLK_EN_LEN) - 1) << PDS_REG_MCU1_CLK_EN_POS))

/* 0x12C : cpu_core_cfg7 */
#define PDS_CPU_CORE_CFG7_OFFSET (0x12C)
#define PDS_REG_PICO_DIV         PDS_REG_PICO_DIV
#define PDS_REG_PICO_DIV_POS     (0U)
#define PDS_REG_PICO_DIV_LEN     (8U)
#define PDS_REG_PICO_DIV_MSK     (((1U << PDS_REG_PICO_DIV_LEN) - 1) << PDS_REG_PICO_DIV_POS)
#define PDS_REG_PICO_DIV_UMSK    (~(((1U << PDS_REG_PICO_DIV_LEN) - 1) << PDS_REG_PICO_DIV_POS))
#define PDS_E902_LPMD_B          PDS_E902_LPMD_B
#define PDS_E902_LPMD_B_POS      (28U)
#define PDS_E902_LPMD_B_LEN      (2U)
#define PDS_E902_LPMD_B_MSK      (((1U << PDS_E902_LPMD_B_LEN) - 1) << PDS_E902_LPMD_B_POS)
#define PDS_E902_LPMD_B_UMSK     (~(((1U << PDS_E902_LPMD_B_LEN) - 1) << PDS_E902_LPMD_B_POS))
#define PDS_PICO_RST_MASK        PDS_PICO_RST_MASK
#define PDS_PICO_RST_MASK_POS    (31U)
#define PDS_PICO_RST_MASK_LEN    (1U)
#define PDS_PICO_RST_MASK_MSK    (((1U << PDS_PICO_RST_MASK_LEN) - 1) << PDS_PICO_RST_MASK_POS)
#define PDS_PICO_RST_MASK_UMSK   (~(((1U << PDS_PICO_RST_MASK_LEN) - 1) << PDS_PICO_RST_MASK_POS))

/* 0x130 : cpu_core_cfg8 */
#define PDS_CPU_CORE_CFG8_OFFSET (0x130)
#define PDS_E902_RTC_DIV         PDS_E902_RTC_DIV
#define PDS_E902_RTC_DIV_POS     (0U)
#define PDS_E902_RTC_DIV_LEN     (10U)
#define PDS_E902_RTC_DIV_MSK     (((1U << PDS_E902_RTC_DIV_LEN) - 1) << PDS_E902_RTC_DIV_POS)
#define PDS_E902_RTC_DIV_UMSK    (~(((1U << PDS_E902_RTC_DIV_LEN) - 1) << PDS_E902_RTC_DIV_POS))
#define PDS_E902_RTC_RST         PDS_E902_RTC_RST
#define PDS_E902_RTC_RST_POS     (30U)
#define PDS_E902_RTC_RST_LEN     (1U)
#define PDS_E902_RTC_RST_MSK     (((1U << PDS_E902_RTC_RST_LEN) - 1) << PDS_E902_RTC_RST_POS)
#define PDS_E902_RTC_RST_UMSK    (~(((1U << PDS_E902_RTC_RST_LEN) - 1) << PDS_E902_RTC_RST_POS))
#define PDS_E902_RTC_EN          PDS_E902_RTC_EN
#define PDS_E902_RTC_EN_POS      (31U)
#define PDS_E902_RTC_EN_LEN      (1U)
#define PDS_E902_RTC_EN_MSK      (((1U << PDS_E902_RTC_EN_LEN) - 1) << PDS_E902_RTC_EN_POS)
#define PDS_E902_RTC_EN_UMSK     (~(((1U << PDS_E902_RTC_EN_LEN) - 1) << PDS_E902_RTC_EN_POS))

/* 0x134 : cpu_core_cfg9 */
#define PDS_CPU_CORE_CFG9_OFFSET (0x134)
#define PDS_PICO_RTC_CNT_L       PDS_PICO_RTC_CNT_L
#define PDS_PICO_RTC_CNT_L_POS   (0U)
#define PDS_PICO_RTC_CNT_L_LEN   (32U)
#define PDS_PICO_RTC_CNT_L_MSK   (((1U << PDS_PICO_RTC_CNT_L_LEN) - 1) << PDS_PICO_RTC_CNT_L_POS)
#define PDS_PICO_RTC_CNT_L_UMSK  (~(((1U << PDS_PICO_RTC_CNT_L_LEN) - 1) << PDS_PICO_RTC_CNT_L_POS))

/* 0x138 : cpu_core_cfg10 */
#define PDS_CPU_CORE_CFG10_OFFSET (0x138)
#define PDS_PICO_RTC_CNT_H        PDS_PICO_RTC_CNT_H
#define PDS_PICO_RTC_CNT_H_POS    (0U)
#define PDS_PICO_RTC_CNT_H_LEN    (32U)
#define PDS_PICO_RTC_CNT_H_MSK    (((1U << PDS_PICO_RTC_CNT_H_LEN) - 1) << PDS_PICO_RTC_CNT_H_POS)
#define PDS_PICO_RTC_CNT_H_UMSK   (~(((1U << PDS_PICO_RTC_CNT_H_LEN) - 1) << PDS_PICO_RTC_CNT_H_POS))

/* 0x140 : cpu_core_cfg12 */
#define PDS_CPU_CORE_CFG12_OFFSET (0x140)
#define PDS_E902_IAHBL_BASE       PDS_E902_IAHBL_BASE
#define PDS_E902_IAHBL_BASE_POS   (0U)
#define PDS_E902_IAHBL_BASE_LEN   (12U)
#define PDS_E902_IAHBL_BASE_MSK   (((1U << PDS_E902_IAHBL_BASE_LEN) - 1) << PDS_E902_IAHBL_BASE_POS)
#define PDS_E902_IAHBL_BASE_UMSK  (~(((1U << PDS_E902_IAHBL_BASE_LEN) - 1) << PDS_E902_IAHBL_BASE_POS))
#define PDS_E902_IAHBL_MASK       PDS_E902_IAHBL_MASK
#define PDS_E902_IAHBL_MASK_POS   (16U)
#define PDS_E902_IAHBL_MASK_LEN   (12U)
#define PDS_E902_IAHBL_MASK_MSK   (((1U << PDS_E902_IAHBL_MASK_LEN) - 1) << PDS_E902_IAHBL_MASK_POS)
#define PDS_E902_IAHBL_MASK_UMSK  (~(((1U << PDS_E902_IAHBL_MASK_LEN) - 1) << PDS_E902_IAHBL_MASK_POS))

/* 0x144 : cpu_core_cfg13 */
#define PDS_CPU_CORE_CFG13_OFFSET (0x144)
#define PDS_E902_RST_ADDR         PDS_E902_RST_ADDR
#define PDS_E902_RST_ADDR_POS     (0U)
#define PDS_E902_RST_ADDR_LEN     (32U)
#define PDS_E902_RST_ADDR_MSK     (((1U << PDS_E902_RST_ADDR_LEN) - 1) << PDS_E902_RST_ADDR_POS)
#define PDS_E902_RST_ADDR_UMSK    (~(((1U << PDS_E902_RST_ADDR_LEN) - 1) << PDS_E902_RST_ADDR_POS))

/* 0x148 : cpu_core_cfg14 */
#define PDS_CPU_CORE_CFG14_OFFSET (0x148)
#define PDS_E906_RST_ADDR         PDS_E906_RST_ADDR
#define PDS_E906_RST_ADDR_POS     (0U)
#define PDS_E906_RST_ADDR_LEN     (32U)
#define PDS_E906_RST_ADDR_MSK     (((1U << PDS_E906_RST_ADDR_LEN) - 1) << PDS_E906_RST_ADDR_POS)
#define PDS_E906_RST_ADDR_UMSK    (~(((1U << PDS_E906_RST_ADDR_LEN) - 1) << PDS_E906_RST_ADDR_POS))

