RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0x400 : pu_rst_clkpll */
#define PDS_PU_RST_CLKPLL_OFFSET        (0x400)
#define PDS_CR_PDS_PU_CLKPLL_SFREG      PDS_CR_PDS_PU_CLKPLL_SFREG
#define PDS_CR_PDS_PU_CLKPLL_SFREG_POS  (9U)
#define PDS_CR_PDS_PU_CLKPLL_SFREG_LEN  (1U)
#define PDS_CR_PDS_PU_CLKPLL_SFREG_MSK  (((1U << PDS_CR_PDS_PU_CLKPLL_SFREG_LEN) - 1) << PDS_CR_PDS_PU_CLKPLL_SFREG_POS)
#define PDS_CR_PDS_PU_CLKPLL_SFREG_UMSK (~(((1U << PDS_CR_PDS_PU_CLKPLL_SFREG_LEN) - 1) << PDS_CR_PDS_PU_CLKPLL_SFREG_POS))
#define PDS_CR_PDS_PU_CLKPLL            PDS_CR_PDS_PU_CLKPLL
#define PDS_CR_PDS_PU_CLKPLL_POS        (10U)
#define PDS_CR_PDS_PU_CLKPLL_LEN        (1U)
#define PDS_CR_PDS_PU_CLKPLL_MSK        (((1U << PDS_CR_PDS_PU_CLKPLL_LEN) - 1) << PDS_CR_PDS_PU_CLKPLL_POS)
#define PDS_CR_PDS_PU_CLKPLL_UMSK       (~(((1U << PDS_CR_PDS_PU_CLKPLL_LEN) - 1) << PDS_CR_PDS_PU_CLKPLL_POS))

/* 0x500 : usb_ctl */
#define PDS_USB_CTL_OFFSET          (0x500)
#define PDS_REG_USB_SW_RST_N        PDS_REG_USB_SW_RST_N
#define PDS_REG_USB_SW_RST_N_POS    (0U)
#define PDS_REG_USB_SW_RST_N_LEN    (1U)
#define PDS_REG_USB_SW_RST_N_MSK    (((1U << PDS_REG_USB_SW_RST_N_LEN) - 1) << PDS_REG_USB_SW_RST_N_POS)
#define PDS_REG_USB_SW_RST_N_UMSK   (~(((1U << PDS_REG_USB_SW_RST_N_LEN) - 1) << PDS_REG_USB_SW_RST_N_POS))
#define PDS_REG_USB_EXT_SUSP_N      PDS_REG_USB_EXT_SUSP_N
#define PDS_REG_USB_EXT_SUSP_N_POS  (1U)
#define PDS_REG_USB_EXT_SUSP_N_LEN  (1U)
#define PDS_REG_USB_EXT_SUSP_N_MSK  (((1U << PDS_REG_USB_EXT_SUSP_N_LEN) - 1) << PDS_REG_USB_EXT_SUSP_N_POS)
#define PDS_REG_USB_EXT_SUSP_N_UMSK (~(((1U << PDS_REG_USB_EXT_SUSP_N_LEN) - 1) << PDS_REG_USB_EXT_SUSP_N_POS))
#define PDS_REG_USB_WAKEUP          PDS_REG_USB_WAKEUP
#define PDS_REG_USB_WAKEUP_POS      (2U)
#define PDS_REG_USB_WAKEUP_LEN      (1U)
#define PDS_REG_USB_WAKEUP_MSK      (((1U << PDS_REG_USB_WAKEUP_LEN) - 1) << PDS_REG_USB_WAKEUP_POS)
#define PDS_REG_USB_WAKEUP_UMSK     (~(((1U << PDS_REG_USB_WAKEUP_LEN) - 1) << PDS_REG_USB_WAKEUP_POS))
#define PDS_REG_USB_L1_WAKEUP       PDS_REG_USB_L1_WAKEUP
#define PDS_REG_USB_L1_WAKEUP_POS   (3U)
#define PDS_REG_USB_L1_WAKEUP_LEN   (1U)
#define PDS_REG_USB_L1_WAKEUP_MSK   (((1U << PDS_REG_USB_L1_WAKEUP_LEN) - 1) << PDS_REG_USB_L1_WAKEUP_POS)
#define PDS_REG_USB_L1_WAKEUP_UMSK  (~(((1U << PDS_REG_USB_L1_WAKEUP_LEN) - 1) << PDS_REG_USB_L1_WAKEUP_POS))
#define PDS_REG_USB_DRVBUS_POL      PDS_REG_USB_DRVBUS_POL
#define PDS_REG_USB_DRVBUS_POL_POS  (4U)
#define PDS_REG_USB_DRVBUS_POL_LEN  (1U)
#define PDS_REG_USB_DRVBUS_POL_MSK  (((1U << PDS_REG_USB_DRVBUS_POL_LEN) - 1) << PDS_REG_USB_DRVBUS_POL_POS)
#define PDS_REG_USB_DRVBUS_POL_UMSK (~(((1U << PDS_REG_USB_DRVBUS_POL_LEN) - 1) << PDS_REG_USB_DRVBUS_POL_POS))
#define PDS_REG_USB_IDDIG           PDS_REG_USB_IDDIG
#define PDS_REG_USB_IDDIG_POS       (5U)
#define PDS_REG_USB_IDDIG_LEN       (1U)
#define PDS_REG_USB_IDDIG_MSK       (((1U << PDS_REG_USB_IDDIG_LEN) - 1) << PDS_REG_USB_IDDIG_POS)
#define PDS_REG_USB_IDDIG_UMSK      (~(((1U << PDS_REG_USB_IDDIG_LEN) - 1) << PDS_REG_USB_IDDIG_POS))

/* 0x504 : usb_phy_ctrl */
#define PDS_USB_PHY_CTRL_OFFSET        (0x504)
#define PDS_REG_USB_PHY_PONRST         PDS_REG_USB_PHY_PONRST
#define PDS_REG_USB_PHY_PONRST_POS     (0U)
#define PDS_REG_USB_PHY_PONRST_LEN     (1U)
#define PDS_REG_USB_PHY_PONRST_MSK     (((1U << PDS_REG_USB_PHY_PONRST_LEN) - 1) << PDS_REG_USB_PHY_PONRST_POS)
#define PDS_REG_USB_PHY_PONRST_UMSK    (~(((1U << PDS_REG_USB_PHY_PONRST_LEN) - 1) << PDS_REG_USB_PHY_PONRST_POS))
#define PDS_REG_USB_PHY_OSCOUTEN       PDS_REG_USB_PHY_OSCOUTEN
#define PDS_REG_USB_PHY_OSCOUTEN_POS   (1U)
#define PDS_REG_USB_PHY_OSCOUTEN_LEN   (1U)
#define PDS_REG_USB_PHY_OSCOUTEN_MSK   (((1U << PDS_REG_USB_PHY_OSCOUTEN_LEN) - 1) << PDS_REG_USB_PHY_OSCOUTEN_POS)
#define PDS_REG_USB_PHY_OSCOUTEN_UMSK  (~(((1U << PDS_REG_USB_PHY_OSCOUTEN_LEN) - 1) << PDS_REG_USB_PHY_OSCOUTEN_POS))
#define PDS_REG_USB_PHY_XTLSEL         PDS_REG_USB_PHY_XTLSEL
#define PDS_REG_USB_PHY_XTLSEL_POS     (2U)
#define PDS_REG_USB_PHY_XTLSEL_LEN     (2U)
#define PDS_REG_USB_PHY_XTLSEL_MSK     (((1U << PDS_REG_USB_PHY_XTLSEL_LEN) - 1) << PDS_REG_USB_PHY_XTLSEL_POS)
#define PDS_REG_USB_PHY_XTLSEL_UMSK    (~(((1U << PDS_REG_USB_PHY_XTLSEL_LEN) - 1) << PDS_REG_USB_PHY_XTLSEL_POS))
#define PDS_REG_USB_PHY_OUTCLKSEL      PDS_REG_USB_PHY_OUTCLKSEL
#define PDS_REG_USB_PHY_OUTCLKSEL_POS  (4U)
#define PDS_REG_USB_PHY_OUTCLKSEL_LEN  (1U)
#define PDS_REG_USB_PHY_OUTCLKSEL_MSK  (((1U << PDS_REG_USB_PHY_OUTCLKSEL_LEN) - 1) << PDS_REG_USB_PHY_OUTCLKSEL_POS)
#define PDS_REG_USB_PHY_OUTCLKSEL_UMSK (~(((1U << PDS_REG_USB_PHY_OUTCLKSEL_LEN) - 1) << PDS_REG_USB_PHY_OUTCLKSEL_POS))
#define PDS_REG_USB_PHY_PLLALIV        PDS_REG_USB_PHY_PLLALIV
#define PDS_REG_USB_PHY_PLLALIV_POS    (5U)
#define PDS_REG_USB_PHY_PLLALIV_LEN    (1U)
#define PDS_REG_USB_PHY_PLLALIV_MSK    (((1U << PDS_REG_USB_PHY_PLLALIV_LEN) - 1) << PDS_REG_USB_PHY_PLLALIV_POS)
#define PDS_REG_USB_PHY_PLLALIV_UMSK   (~(((1U << PDS_REG_USB_PHY_PLLALIV_LEN) - 1) << PDS_REG_USB_PHY_PLLALIV_POS))
#define PDS_REG_PU_USB20_PSW           PDS_REG_PU_USB20_PSW
#define PDS_REG_PU_USB20_PSW_POS       (6U)
#define PDS_REG_PU_USB20_PSW_LEN       (1U)
#define PDS_REG_PU_USB20_PSW_MSK       (((1U << PDS_REG_PU_USB20_PSW_LEN) - 1) << PDS_REG_PU_USB20_PSW_POS)
#define PDS_REG_PU_USB20_PSW_UMSK      (~(((1U << PDS_REG_PU_USB20_PSW_LEN) - 1) << PDS_REG_PU_USB20_PSW_POS))

/* 0xA00 : touch channel, clock, ana config1 */
#define PDS_TOUCH1_OFFSET            (0xA00)
#define PDS_TOUCH_VREF_SEL           PDS_TOUCH_VREF_SEL
#define PDS_TOUCH_VREF_SEL_POS       (0U)
#define PDS_TOUCH_VREF_SEL_LEN       (3U)
#define PDS_TOUCH_VREF_SEL_MSK       (((1U << PDS_TOUCH_VREF_SEL_LEN) - 1) << PDS_TOUCH_VREF_SEL_POS)
#define PDS_TOUCH_VREF_SEL_UMSK      (~(((1U << PDS_TOUCH_VREF_SEL_LEN) - 1) << PDS_TOUCH_VREF_SEL_POS))
#define PDS_TOUCH_VLDO_SEL           PDS_TOUCH_VLDO_SEL
#define PDS_TOUCH_VLDO_SEL_POS       (3U)
#define PDS_TOUCH_VLDO_SEL_LEN       (3U)
#define PDS_TOUCH_VLDO_SEL_MSK       (((1U << PDS_TOUCH_VLDO_SEL_LEN) - 1) << PDS_TOUCH_VLDO_SEL_POS)
#define PDS_TOUCH_VLDO_SEL_UMSK      (~(((1U << PDS_TOUCH_VLDO_SEL_LEN) - 1) << PDS_TOUCH_VLDO_SEL_POS))
#define PDS_TOUCH_COMP_HYS_SEL       PDS_TOUCH_COMP_HYS_SEL
#define PDS_TOUCH_COMP_HYS_SEL_POS   (6U)
#define PDS_TOUCH_COMP_HYS_SEL_LEN   (1U)
#define PDS_TOUCH_COMP_HYS_SEL_MSK   (((1U << PDS_TOUCH_COMP_HYS_SEL_LEN) - 1) << PDS_TOUCH_COMP_HYS_SEL_POS)
#define PDS_TOUCH_COMP_HYS_SEL_UMSK  (~(((1U << PDS_TOUCH_COMP_HYS_SEL_LEN) - 1) << PDS_TOUCH_COMP_HYS_SEL_POS))
#define PDS_TOUCH_CURRENT_SEL        PDS_TOUCH_CURRENT_SEL
#define PDS_TOUCH_CURRENT_SEL_POS    (7U)
#define PDS_TOUCH_CURRENT_SEL_LEN    (1U)
#define PDS_TOUCH_CURRENT_SEL_MSK    (((1U << PDS_TOUCH_CURRENT_SEL_LEN) - 1) << PDS_TOUCH_CURRENT_SEL_POS)
#define PDS_TOUCH_CURRENT_SEL_UMSK   (~(((1U << PDS_TOUCH_CURRENT_SEL_LEN) - 1) << PDS_TOUCH_CURRENT_SEL_POS))
#define PDS_TOUCH_CLK_SEL            PDS_TOUCH_CLK_SEL
#define PDS_TOUCH_CLK_SEL_POS        (16U)
#define PDS_TOUCH_CLK_SEL_LEN        (1U)
#define PDS_TOUCH_CLK_SEL_MSK        (((1U << PDS_TOUCH_CLK_SEL_LEN) - 1) << PDS_TOUCH_CLK_SEL_POS)
#define PDS_TOUCH_CLK_SEL_UMSK       (~(((1U << PDS_TOUCH_CLK_SEL_LEN) - 1) << PDS_TOUCH_CLK_SEL_POS))
#define PDS_TOUCH_CLK_DIV_RATIO      PDS_TOUCH_CLK_DIV_RATIO
#define PDS_TOUCH_CLK_DIV_RATIO_POS  (17U)
#define PDS_TOUCH_CLK_DIV_RATIO_LEN  (3U)
#define PDS_TOUCH_CLK_DIV_RATIO_MSK  (((1U << PDS_TOUCH_CLK_DIV_RATIO_LEN) - 1) << PDS_TOUCH_CLK_DIV_RATIO_POS)
#define PDS_TOUCH_CLK_DIV_RATIO_UMSK (~(((1U << PDS_TOUCH_CLK_DIV_RATIO_LEN) - 1) << PDS_TOUCH_CLK_DIV_RATIO_POS))
#define PDS_TOUCH_PCHARGE_HIGH       PDS_TOUCH_PCHARGE_HIGH
#define PDS_TOUCH_PCHARGE_HIGH_POS   (20U)
#define PDS_TOUCH_PCHARGE_HIGH_LEN   (3U)
#define PDS_TOUCH_PCHARGE_HIGH_MSK   (((1U << PDS_TOUCH_PCHARGE_HIGH_LEN) - 1) << PDS_TOUCH_PCHARGE_HIGH_POS)
#define PDS_TOUCH_PCHARGE_HIGH_UMSK  (~(((1U << PDS_TOUCH_PCHARGE_HIGH_LEN) - 1) << PDS_TOUCH_PCHARGE_HIGH_POS))
#define PDS_TOUCH_PCHARGE_LOW        PDS_TOUCH_PCHARGE_LOW
#define PDS_TOUCH_PCHARGE_LOW_POS    (23U)
#define PDS_TOUCH_PCHARGE_LOW_LEN    (3U)
#define PDS_TOUCH_PCHARGE_LOW_MSK    (((1U << PDS_TOUCH_PCHARGE_LOW_LEN) - 1) << PDS_TOUCH_PCHARGE_LOW_POS)
#define PDS_TOUCH_PCHARGE_LOW_UMSK   (~(((1U << PDS_TOUCH_PCHARGE_LOW_LEN) - 1) << PDS_TOUCH_PCHARGE_LOW_POS))
#define PDS_TOUCH_CONT_EN            PDS_TOUCH_CONT_EN
#define PDS_TOUCH_CONT_EN_POS        (26U)
#define PDS_TOUCH_CONT_EN_LEN        (1U)
#define PDS_TOUCH_CONT_EN_MSK        (((1U << PDS_TOUCH_CONT_EN_LEN) - 1) << PDS_TOUCH_CONT_EN_POS)
#define PDS_TOUCH_CONT_EN_UMSK       (~(((1U << PDS_TOUCH_CONT_EN_LEN) - 1) << PDS_TOUCH_CONT_EN_POS))
#define PDS_TOUCH_CYCLE_EN           PDS_TOUCH_CYCLE_EN
#define PDS_TOUCH_CYCLE_EN_POS       (27U)
#define PDS_TOUCH_CYCLE_EN_LEN       (1U)
#define PDS_TOUCH_CYCLE_EN_MSK       (((1U << PDS_TOUCH_CYCLE_EN_LEN) - 1) << PDS_TOUCH_CYCLE_EN_POS)
#define PDS_TOUCH_CYCLE_EN_UMSK      (~(((1U << PDS_TOUCH_CYCLE_EN_LEN) - 1) << PDS_TOUCH_CYCLE_EN_POS))
#define PDS_TOUCH_ULP_EN             PDS_TOUCH_ULP_EN
#define PDS_TOUCH_ULP_EN_POS         (28U)
#define PDS_TOUCH_ULP_EN_LEN         (1U)
#define PDS_TOUCH_ULP_EN_MSK         (((1U << PDS_TOUCH_ULP_EN_LEN) - 1) << PDS_TOUCH_ULP_EN_POS)
#define PDS_TOUCH_ULP_EN_UMSK        (~(((1U << PDS_TOUCH_ULP_EN_LEN) - 1) << PDS_TOUCH_ULP_EN_POS))
#define PDS_PU_TOUCH                 PDS_PU_TOUCH
#define PDS_PU_TOUCH_POS             (30U)
#define PDS_PU_TOUCH_LEN             (1U)
#define PDS_PU_TOUCH_MSK             (((1U << PDS_PU_TOUCH_LEN) - 1) << PDS_PU_TOUCH_POS)
#define PDS_PU_TOUCH_UMSK            (~(((1U << PDS_PU_TOUCH_LEN) - 1) << PDS_PU_TOUCH_POS))

/* 0xA04 : touch channel, clock, ana config2 */
#define PDS_TOUCH2_OFFSET                 (0xA04)
#define PDS_TOUCH_CHANNEL_SEL             PDS_TOUCH_CHANNEL_SEL
#define PDS_TOUCH_CHANNEL_SEL_POS         (0U)
#define PDS_TOUCH_CHANNEL_SEL_LEN         (4U)
#define PDS_TOUCH_CHANNEL_SEL_MSK         (((1U << PDS_TOUCH_CHANNEL_SEL_LEN) - 1) << PDS_TOUCH_CHANNEL_SEL_POS)
#define PDS_TOUCH_CHANNEL_SEL_UMSK        (~(((1U << PDS_TOUCH_CHANNEL_SEL_LEN) - 1) << PDS_TOUCH_CHANNEL_SEL_POS))
#define PDS_TOUCH_CHANNEL0_HIGHZ_EN       PDS_TOUCH_CHANNEL0_HIGHZ_EN
#define PDS_TOUCH_CHANNEL0_HIGHZ_EN_POS   (4U)
#define PDS_TOUCH_CHANNEL0_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL0_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL0_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL0_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL0_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL0_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL0_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL1_HIGHZ_EN       PDS_TOUCH_CHANNEL1_HIGHZ_EN
#define PDS_TOUCH_CHANNEL1_HIGHZ_EN_POS   (5U)
#define PDS_TOUCH_CHANNEL1_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL1_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL1_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL1_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL1_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL1_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL1_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL2_HIGHZ_EN       PDS_TOUCH_CHANNEL2_HIGHZ_EN
#define PDS_TOUCH_CHANNEL2_HIGHZ_EN_POS   (6U)
#define PDS_TOUCH_CHANNEL2_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL2_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL2_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL2_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL2_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL2_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL2_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL3_HIGHZ_EN       PDS_TOUCH_CHANNEL3_HIGHZ_EN
#define PDS_TOUCH_CHANNEL3_HIGHZ_EN_POS   (7U)
#define PDS_TOUCH_CHANNEL3_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL3_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL3_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL3_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL3_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL3_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL3_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL4_HIGHZ_EN       PDS_TOUCH_CHANNEL4_HIGHZ_EN
#define PDS_TOUCH_CHANNEL4_HIGHZ_EN_POS   (8U)
#define PDS_TOUCH_CHANNEL4_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL4_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL4_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL4_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL4_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL4_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL4_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL5_HIGHZ_EN       PDS_TOUCH_CHANNEL5_HIGHZ_EN
#define PDS_TOUCH_CHANNEL5_HIGHZ_EN_POS   (9U)
#define PDS_TOUCH_CHANNEL5_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL5_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL5_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL5_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL5_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL5_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL5_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL6_HIGHZ_EN       PDS_TOUCH_CHANNEL6_HIGHZ_EN
#define PDS_TOUCH_CHANNEL6_HIGHZ_EN_POS   (10U)
#define PDS_TOUCH_CHANNEL6_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL6_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL6_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL6_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL6_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL6_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL6_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL7_HIGHZ_EN       PDS_TOUCH_CHANNEL7_HIGHZ_EN
#define PDS_TOUCH_CHANNEL7_HIGHZ_EN_POS   (11U)
#define PDS_TOUCH_CHANNEL7_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL7_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL7_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL7_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL7_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL7_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL7_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL8_HIGHZ_EN       PDS_TOUCH_CHANNEL8_HIGHZ_EN
#define PDS_TOUCH_CHANNEL8_HIGHZ_EN_POS   (12U)
#define PDS_TOUCH_CHANNEL8_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL8_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL8_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL8_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL8_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL8_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL8_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL9_HIGHZ_EN       PDS_TOUCH_CHANNEL9_HIGHZ_EN
#define PDS_TOUCH_CHANNEL9_HIGHZ_EN_POS   (13U)
#define PDS_TOUCH_CHANNEL9_HIGHZ_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL9_HIGHZ_EN_MSK   (((1U << PDS_TOUCH_CHANNEL9_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL9_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL9_HIGHZ_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL9_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL9_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL10_HIGHZ_EN      PDS_TOUCH_CHANNEL10_HIGHZ_EN
#define PDS_TOUCH_CHANNEL10_HIGHZ_EN_POS  (14U)
#define PDS_TOUCH_CHANNEL10_HIGHZ_EN_LEN  (1U)
#define PDS_TOUCH_CHANNEL10_HIGHZ_EN_MSK  (((1U << PDS_TOUCH_CHANNEL10_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL10_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL10_HIGHZ_EN_UMSK (~(((1U << PDS_TOUCH_CHANNEL10_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL10_HIGHZ_EN_POS))
#define PDS_TOUCH_CHANNEL11_HIGHZ_EN      PDS_TOUCH_CHANNEL11_HIGHZ_EN
#define PDS_TOUCH_CHANNEL11_HIGHZ_EN_POS  (15U)
#define PDS_TOUCH_CHANNEL11_HIGHZ_EN_LEN  (1U)
#define PDS_TOUCH_CHANNEL11_HIGHZ_EN_MSK  (((1U << PDS_TOUCH_CHANNEL11_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL11_HIGHZ_EN_POS)
#define PDS_TOUCH_CHANNEL11_HIGHZ_EN_UMSK (~(((1U << PDS_TOUCH_CHANNEL11_HIGHZ_EN_LEN) - 1) << PDS_TOUCH_CHANNEL11_HIGHZ_EN_POS))

