RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0xA30 : Channel_vth_data_1 */
#define PDS_CHANNEL_VTH_DATA_1_OFFSET (0xA30)
#define PDS_TOUCH_VTH_DATA_CH4        PDS_TOUCH_VTH_DATA_CH4
#define PDS_TOUCH_VTH_DATA_CH4_POS    (0U)
#define PDS_TOUCH_VTH_DATA_CH4_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH4_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH4_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH4_POS)
#define PDS_TOUCH_VTH_DATA_CH4_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH4_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH4_POS))
#define PDS_TOUCH_VTH_DATA_CH5        PDS_TOUCH_VTH_DATA_CH5
#define PDS_TOUCH_VTH_DATA_CH5_POS    (8U)
#define PDS_TOUCH_VTH_DATA_CH5_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH5_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH5_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH5_POS)
#define PDS_TOUCH_VTH_DATA_CH5_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH5_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH5_POS))
#define PDS_TOUCH_VTH_DATA_CH6        PDS_TOUCH_VTH_DATA_CH6
#define PDS_TOUCH_VTH_DATA_CH6_POS    (16U)
#define PDS_TOUCH_VTH_DATA_CH6_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH6_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH6_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH6_POS)
#define PDS_TOUCH_VTH_DATA_CH6_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH6_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH6_POS))
#define PDS_TOUCH_VTH_DATA_CH7        PDS_TOUCH_VTH_DATA_CH7
#define PDS_TOUCH_VTH_DATA_CH7_POS    (24U)
#define PDS_TOUCH_VTH_DATA_CH7_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH7_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH7_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH7_POS)
#define PDS_TOUCH_VTH_DATA_CH7_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH7_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH7_POS))

/* 0xA34 : Channel_vth_data_2 */
#define PDS_CHANNEL_VTH_DATA_2_OFFSET (0xA34)
#define PDS_TOUCH_VTH_DATA_CH8        PDS_TOUCH_VTH_DATA_CH8
#define PDS_TOUCH_VTH_DATA_CH8_POS    (0U)
#define PDS_TOUCH_VTH_DATA_CH8_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH8_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH8_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH8_POS)
#define PDS_TOUCH_VTH_DATA_CH8_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH8_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH8_POS))
#define PDS_TOUCH_VTH_DATA_CH9        PDS_TOUCH_VTH_DATA_CH9
#define PDS_TOUCH_VTH_DATA_CH9_POS    (8U)
#define PDS_TOUCH_VTH_DATA_CH9_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH9_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH9_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH9_POS)
#define PDS_TOUCH_VTH_DATA_CH9_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH9_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH9_POS))
#define PDS_TOUCH_VTH_DATA_CH10       PDS_TOUCH_VTH_DATA_CH10
#define PDS_TOUCH_VTH_DATA_CH10_POS   (16U)
#define PDS_TOUCH_VTH_DATA_CH10_LEN   (8U)
#define PDS_TOUCH_VTH_DATA_CH10_MSK   (((1U << PDS_TOUCH_VTH_DATA_CH10_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH10_POS)
#define PDS_TOUCH_VTH_DATA_CH10_UMSK  (~(((1U << PDS_TOUCH_VTH_DATA_CH10_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH10_POS))
#define PDS_TOUCH_VTH_DATA_CH11       PDS_TOUCH_VTH_DATA_CH11
#define PDS_TOUCH_VTH_DATA_CH11_POS   (24U)
#define PDS_TOUCH_VTH_DATA_CH11_LEN   (8U)
#define PDS_TOUCH_VTH_DATA_CH11_MSK   (((1U << PDS_TOUCH_VTH_DATA_CH11_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH11_POS)
#define PDS_TOUCH_VTH_DATA_CH11_UMSK  (~(((1U << PDS_TOUCH_VTH_DATA_CH11_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH11_POS))

/* 0xA38 : Channel_raw_data_0 */
#define PDS_CHANNEL_RAW_DATA_0_OFFSET (0xA38)
#define PDS_TOUCH_RAW_DATA_CH0        PDS_TOUCH_RAW_DATA_CH0
#define PDS_TOUCH_RAW_DATA_CH0_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH0_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH0_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH0_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH0_POS)
#define PDS_TOUCH_RAW_DATA_CH0_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH0_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH0_POS))

/* 0xA3C : Channel_raw_data_1 */
#define PDS_CHANNEL_RAW_DATA_1_OFFSET (0xA3C)
#define PDS_TOUCH_RAW_DATA_CH1        PDS_TOUCH_RAW_DATA_CH1
#define PDS_TOUCH_RAW_DATA_CH1_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH1_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH1_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH1_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH1_POS)
#define PDS_TOUCH_RAW_DATA_CH1_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH1_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH1_POS))

/* 0xA40 : Channel_raw_data_2 */
#define PDS_CHANNEL_RAW_DATA_2_OFFSET (0xA40)
#define PDS_TOUCH_RAW_DATA_CH2        PDS_TOUCH_RAW_DATA_CH2
#define PDS_TOUCH_RAW_DATA_CH2_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH2_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH2_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH2_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH2_POS)
#define PDS_TOUCH_RAW_DATA_CH2_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH2_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH2_POS))

/* 0xA44 : Channel_raw_data_3 */
#define PDS_CHANNEL_RAW_DATA_3_OFFSET (0xA44)
#define PDS_TOUCH_RAW_DATA_CH3        PDS_TOUCH_RAW_DATA_CH3
#define PDS_TOUCH_RAW_DATA_CH3_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH3_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH3_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH3_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH3_POS)
#define PDS_TOUCH_RAW_DATA_CH3_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH3_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH3_POS))

/* 0xA48 : Channel_raw_data_4 */
#define PDS_CHANNEL_RAW_DATA_4_OFFSET (0xA48)
#define PDS_TOUCH_RAW_DATA_CH4        PDS_TOUCH_RAW_DATA_CH4
#define PDS_TOUCH_RAW_DATA_CH4_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH4_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH4_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH4_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH4_POS)
#define PDS_TOUCH_RAW_DATA_CH4_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH4_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH4_POS))

/* 0xA4C : Channel_raw_data_5 */
#define PDS_CHANNEL_RAW_DATA_5_OFFSET (0xA4C)
#define PDS_TOUCH_RAW_DATA_CH5        PDS_TOUCH_RAW_DATA_CH5
#define PDS_TOUCH_RAW_DATA_CH5_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH5_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH5_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH5_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH5_POS)
#define PDS_TOUCH_RAW_DATA_CH5_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH5_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH5_POS))

/* 0xA50 : Channel_raw_data_6 */
#define PDS_CHANNEL_RAW_DATA_6_OFFSET (0xA50)
#define PDS_TOUCH_RAW_DATA_CH6        PDS_TOUCH_RAW_DATA_CH6
#define PDS_TOUCH_RAW_DATA_CH6_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH6_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH6_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH6_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH6_POS)
#define PDS_TOUCH_RAW_DATA_CH6_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH6_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH6_POS))

/* 0xA54 : Channel_raw_data_7 */
#define PDS_CHANNEL_RAW_DATA_7_OFFSET (0xA54)
#define PDS_TOUCH_RAW_DATA_CH7        PDS_TOUCH_RAW_DATA_CH7
#define PDS_TOUCH_RAW_DATA_CH7_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH7_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH7_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH7_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH7_POS)
#define PDS_TOUCH_RAW_DATA_CH7_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH7_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH7_POS))

/* 0xA58 : Channel_raw_data_8 */
#define PDS_CHANNEL_RAW_DATA_8_OFFSET (0xA58)
#define PDS_TOUCH_RAW_DATA_CH8        PDS_TOUCH_RAW_DATA_CH8
#define PDS_TOUCH_RAW_DATA_CH8_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH8_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH8_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH8_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH8_POS)
#define PDS_TOUCH_RAW_DATA_CH8_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH8_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH8_POS))

/* 0xA5C : Channel_raw_data_9 */
#define PDS_CHANNEL_RAW_DATA_9_OFFSET (0xA5C)
#define PDS_TOUCH_RAW_DATA_CH9        PDS_TOUCH_RAW_DATA_CH9
#define PDS_TOUCH_RAW_DATA_CH9_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH9_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH9_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH9_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH9_POS)
#define PDS_TOUCH_RAW_DATA_CH9_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH9_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH9_POS))

/* 0xA60 : Channel_raw_data_10 */
#define PDS_CHANNEL_RAW_DATA_10_OFFSET (0xA60)
#define PDS_TOUCH_RAW_DATA_CH10        PDS_TOUCH_RAW_DATA_CH10
#define PDS_TOUCH_RAW_DATA_CH10_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH10_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH10_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH10_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH10_POS)
#define PDS_TOUCH_RAW_DATA_CH10_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH10_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH10_POS))

