RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0xA64 : Channel_raw_data_11 */
#define PDS_CHANNEL_RAW_DATA_11_OFFSET (0xA64)
#define PDS_TOUCH_RAW_DATA_CH11        PDS_TOUCH_RAW_DATA_CH11
#define PDS_TOUCH_RAW_DATA_CH11_POS    (0U)
#define PDS_TOUCH_RAW_DATA_CH11_LEN    (16U)
#define PDS_TOUCH_RAW_DATA_CH11_MSK    (((1U << PDS_TOUCH_RAW_DATA_CH11_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH11_POS)
#define PDS_TOUCH_RAW_DATA_CH11_UMSK   (~(((1U << PDS_TOUCH_RAW_DATA_CH11_LEN) - 1) << PDS_TOUCH_RAW_DATA_CH11_POS))

/* 0xA68 : Channel_LTA_data_0 */
#define PDS_CHANNEL_LTA_DATA_0_OFFSET (0xA68)
#define PDS_TOUCH_LTA_DATA_CH0        PDS_TOUCH_LTA_DATA_CH0
#define PDS_TOUCH_LTA_DATA_CH0_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH0_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH0_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH0_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH0_POS)
#define PDS_TOUCH_LTA_DATA_CH0_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH0_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH0_POS))

/* 0xA6C : Channel_LTA_data_1 */
#define PDS_CHANNEL_LTA_DATA_1_OFFSET (0xA6C)
#define PDS_TOUCH_LTA_DATA_CH1        PDS_TOUCH_LTA_DATA_CH1
#define PDS_TOUCH_LTA_DATA_CH1_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH1_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH1_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH1_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH1_POS)
#define PDS_TOUCH_LTA_DATA_CH1_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH1_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH1_POS))

/* 0xA70 : Channel_LTA_data_2 */
#define PDS_CHANNEL_LTA_DATA_2_OFFSET (0xA70)
#define PDS_TOUCH_LTA_DATA_CH2        PDS_TOUCH_LTA_DATA_CH2
#define PDS_TOUCH_LTA_DATA_CH2_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH2_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH2_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH2_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH2_POS)
#define PDS_TOUCH_LTA_DATA_CH2_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH2_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH2_POS))

/* 0xA74 : Channel_LTA_data_3 */
#define PDS_CHANNEL_LTA_DATA_3_OFFSET (0xA74)
#define PDS_TOUCH_LTA_DATA_CH3        PDS_TOUCH_LTA_DATA_CH3
#define PDS_TOUCH_LTA_DATA_CH3_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH3_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH3_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH3_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH3_POS)
#define PDS_TOUCH_LTA_DATA_CH3_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH3_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH3_POS))

/* 0xA78 : Channel_LTA_data_4 */
#define PDS_CHANNEL_LTA_DATA_4_OFFSET (0xA78)
#define PDS_TOUCH_LTA_DATA_CH4        PDS_TOUCH_LTA_DATA_CH4
#define PDS_TOUCH_LTA_DATA_CH4_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH4_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH4_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH4_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH4_POS)
#define PDS_TOUCH_LTA_DATA_CH4_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH4_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH4_POS))

/* 0xA7C : Channel_LTA_data_5 */
#define PDS_CHANNEL_LTA_DATA_5_OFFSET (0xA7C)
#define PDS_TOUCH_LTA_DATA_CH5        PDS_TOUCH_LTA_DATA_CH5
#define PDS_TOUCH_LTA_DATA_CH5_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH5_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH5_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH5_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH5_POS)
#define PDS_TOUCH_LTA_DATA_CH5_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH5_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH5_POS))

/* 0xA80 : Channel_LTA_data_6 */
#define PDS_CHANNEL_LTA_DATA_6_OFFSET (0xA80)
#define PDS_TOUCH_LTA_DATA_CH6        PDS_TOUCH_LTA_DATA_CH6
#define PDS_TOUCH_LTA_DATA_CH6_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH6_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH6_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH6_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH6_POS)
#define PDS_TOUCH_LTA_DATA_CH6_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH6_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH6_POS))

/* 0xA84 : Channel_LTA_data_7 */
#define PDS_CHANNEL_LTA_DATA_7_OFFSET (0xA84)
#define PDS_TOUCH_LTA_DATA_CH7        PDS_TOUCH_LTA_DATA_CH7
#define PDS_TOUCH_LTA_DATA_CH7_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH7_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH7_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH7_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH7_POS)
#define PDS_TOUCH_LTA_DATA_CH7_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH7_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH7_POS))

/* 0xA88 : Channel_LTA_data_8 */
#define PDS_CHANNEL_LTA_DATA_8_OFFSET (0xA88)
#define PDS_TOUCH_LTA_DATA_CH8        PDS_TOUCH_LTA_DATA_CH8
#define PDS_TOUCH_LTA_DATA_CH8_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH8_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH8_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH8_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH8_POS)
#define PDS_TOUCH_LTA_DATA_CH8_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH8_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH8_POS))

/* 0xA8C : Channel_LTA_data_9 */
#define PDS_CHANNEL_LTA_DATA_9_OFFSET (0xA8C)
#define PDS_TOUCH_LTA_DATA_CH9        PDS_TOUCH_LTA_DATA_CH9
#define PDS_TOUCH_LTA_DATA_CH9_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH9_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH9_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH9_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH9_POS)
#define PDS_TOUCH_LTA_DATA_CH9_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH9_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH9_POS))

/* 0xA90 : Channel_LTA_data_10 */
#define PDS_CHANNEL_LTA_DATA_10_OFFSET (0xA90)
#define PDS_TOUCH_LTA_DATA_CH10        PDS_TOUCH_LTA_DATA_CH10
#define PDS_TOUCH_LTA_DATA_CH10_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH10_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH10_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH10_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH10_POS)
#define PDS_TOUCH_LTA_DATA_CH10_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH10_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH10_POS))

/* 0xA94 : Channel_LTA_data_11 */
#define PDS_CHANNEL_LTA_DATA_11_OFFSET (0xA94)
#define PDS_TOUCH_LTA_DATA_CH11        PDS_TOUCH_LTA_DATA_CH11
#define PDS_TOUCH_LTA_DATA_CH11_POS    (0U)
#define PDS_TOUCH_LTA_DATA_CH11_LEN    (16U)
#define PDS_TOUCH_LTA_DATA_CH11_MSK    (((1U << PDS_TOUCH_LTA_DATA_CH11_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH11_POS)
#define PDS_TOUCH_LTA_DATA_CH11_UMSK   (~(((1U << PDS_TOUCH_LTA_DATA_CH11_LEN) - 1) << PDS_TOUCH_LTA_DATA_CH11_POS))

/* 0xA98 : Channel_FLT_data_0 */
#define PDS_CHANNEL_FLT_DATA_0_OFFSET (0xA98)
#define PDS_TOUCH_FLT_DATA_CH0        PDS_TOUCH_FLT_DATA_CH0
#define PDS_TOUCH_FLT_DATA_CH0_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH0_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH0_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH0_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH0_POS)
#define PDS_TOUCH_FLT_DATA_CH0_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH0_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH0_POS))

/* 0xA9C : Channel_FLT_data_1 */
#define PDS_CHANNEL_FLT_DATA_1_OFFSET (0xA9C)
#define PDS_TOUCH_FLT_DATA_CH1        PDS_TOUCH_FLT_DATA_CH1
#define PDS_TOUCH_FLT_DATA_CH1_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH1_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH1_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH1_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH1_POS)
#define PDS_TOUCH_FLT_DATA_CH1_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH1_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH1_POS))

/* 0xAA0 : Channel_FLT_data_2 */
#define PDS_CHANNEL_FLT_DATA_2_OFFSET (0xAA0)
#define PDS_TOUCH_FLT_DATA_CH2        PDS_TOUCH_FLT_DATA_CH2
#define PDS_TOUCH_FLT_DATA_CH2_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH2_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH2_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH2_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH2_POS)
#define PDS_TOUCH_FLT_DATA_CH2_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH2_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH2_POS))

/* 0xAA4 : Channel_FLT_data_3 */
#define PDS_CHANNEL_FLT_DATA_3_OFFSET (0xAA4)
#define PDS_TOUCH_FLT_DATA_CH3        PDS_TOUCH_FLT_DATA_CH3
#define PDS_TOUCH_FLT_DATA_CH3_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH3_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH3_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH3_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH3_POS)
#define PDS_TOUCH_FLT_DATA_CH3_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH3_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH3_POS))

/* 0xAA8 : Channel_FLT_data_4 */
#define PDS_CHANNEL_FLT_DATA_4_OFFSET (0xAA8)
#define PDS_TOUCH_FLT_DATA_CH4        PDS_TOUCH_FLT_DATA_CH4
#define PDS_TOUCH_FLT_DATA_CH4_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH4_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH4_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH4_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH4_POS)
#define PDS_TOUCH_FLT_DATA_CH4_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH4_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH4_POS))

