RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
/* 0xAAC : Channel_FLT_data_5 */
#define PDS_CHANNEL_FLT_DATA_5_OFFSET (0xAAC)
#define PDS_TOUCH_FLT_DATA_CH5        PDS_TOUCH_FLT_DATA_CH5
#define PDS_TOUCH_FLT_DATA_CH5_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH5_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH5_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH5_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH5_POS)
#define PDS_TOUCH_FLT_DATA_CH5_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH5_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH5_POS))

/* 0xAB0 : Channel_FLT_data_6 */
#define PDS_CHANNEL_FLT_DATA_6_OFFSET (0xAB0)
#define PDS_TOUCH_FLT_DATA_CH6        PDS_TOUCH_FLT_DATA_CH6
#define PDS_TOUCH_FLT_DATA_CH6_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH6_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH6_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH6_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH6_POS)
#define PDS_TOUCH_FLT_DATA_CH6_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH6_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH6_POS))

/* 0xAB4 : Channel_FLT_data_7 */
#define PDS_CHANNEL_FLT_DATA_7_OFFSET (0xAB4)
#define PDS_TOUCH_FLT_DATA_CH7        PDS_TOUCH_FLT_DATA_CH7
#define PDS_TOUCH_FLT_DATA_CH7_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH7_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH7_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH7_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH7_POS)
#define PDS_TOUCH_FLT_DATA_CH7_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH7_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH7_POS))

/* 0xAB8 : Channel_FLT_data_8 */
#define PDS_CHANNEL_FLT_DATA_8_OFFSET (0xAB8)
#define PDS_TOUCH_FLT_DATA_CH8        PDS_TOUCH_FLT_DATA_CH8
#define PDS_TOUCH_FLT_DATA_CH8_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH8_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH8_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH8_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH8_POS)
#define PDS_TOUCH_FLT_DATA_CH8_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH8_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH8_POS))

/* 0xABC : Channel_FLT_data_9 */
#define PDS_CHANNEL_FLT_DATA_9_OFFSET (0xABC)
#define PDS_TOUCH_FLT_DATA_CH9        PDS_TOUCH_FLT_DATA_CH9
#define PDS_TOUCH_FLT_DATA_CH9_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH9_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH9_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH9_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH9_POS)
#define PDS_TOUCH_FLT_DATA_CH9_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH9_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH9_POS))

/* 0xAC0 : Channel_FLT_data_10 */
#define PDS_CHANNEL_FLT_DATA_10_OFFSET (0xAC0)
#define PDS_TOUCH_FLT_DATA_CH10        PDS_TOUCH_FLT_DATA_CH10
#define PDS_TOUCH_FLT_DATA_CH10_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH10_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH10_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH10_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH10_POS)
#define PDS_TOUCH_FLT_DATA_CH10_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH10_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH10_POS))

/* 0xAC4 : Channel_FLT_data_11 */
#define PDS_CHANNEL_FLT_DATA_11_OFFSET (0xAC4)
#define PDS_TOUCH_FLT_DATA_CH11        PDS_TOUCH_FLT_DATA_CH11
#define PDS_TOUCH_FLT_DATA_CH11_POS    (0U)
#define PDS_TOUCH_FLT_DATA_CH11_LEN    (16U)
#define PDS_TOUCH_FLT_DATA_CH11_MSK    (((1U << PDS_TOUCH_FLT_DATA_CH11_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH11_POS)
#define PDS_TOUCH_FLT_DATA_CH11_UMSK   (~(((1U << PDS_TOUCH_FLT_DATA_CH11_LEN) - 1) << PDS_TOUCH_FLT_DATA_CH11_POS))

/* 0xAC8 : touch_rsvd */
#define PDS_TOUCH_RSVD_OFFSET   (0xAC8)
#define PDS_TOUCH_RESERVED      PDS_TOUCH_RESERVED
#define PDS_TOUCH_RESERVED_POS  (0U)
#define PDS_TOUCH_RESERVED_LEN  (8U)
#define PDS_TOUCH_RESERVED_MSK  (((1U << PDS_TOUCH_RESERVED_LEN) - 1) << PDS_TOUCH_RESERVED_POS)
#define PDS_TOUCH_RESERVED_UMSK (~(((1U << PDS_TOUCH_RESERVED_LEN) - 1) << PDS_TOUCH_RESERVED_POS))

/* 0xACC : touch_int_setting */
#define PDS_TOUCH_INT_SETTING_OFFSET (0xACC)
#define PDS_TOUCH_INT_CLR            PDS_TOUCH_INT_CLR
#define PDS_TOUCH_INT_CLR_POS        (0U)
#define PDS_TOUCH_INT_CLR_LEN        (12U)
#define PDS_TOUCH_INT_CLR_MSK        (((1U << PDS_TOUCH_INT_CLR_LEN) - 1) << PDS_TOUCH_INT_CLR_POS)
#define PDS_TOUCH_INT_CLR_UMSK       (~(((1U << PDS_TOUCH_INT_CLR_LEN) - 1) << PDS_TOUCH_INT_CLR_POS))
#define PDS_TOUCH_INT_MASK           PDS_TOUCH_INT_MASK
#define PDS_TOUCH_INT_MASK_POS       (16U)
#define PDS_TOUCH_INT_MASK_LEN       (12U)
#define PDS_TOUCH_INT_MASK_MSK       (((1U << PDS_TOUCH_INT_MASK_LEN) - 1) << PDS_TOUCH_INT_MASK_POS)
#define PDS_TOUCH_INT_MASK_UMSK      (~(((1U << PDS_TOUCH_INT_MASK_LEN) - 1) << PDS_TOUCH_INT_MASK_POS))
#define PDS_TOUCH_INT_EN             PDS_TOUCH_INT_EN
#define PDS_TOUCH_INT_EN_POS         (31U)
#define PDS_TOUCH_INT_EN_LEN         (1U)
#define PDS_TOUCH_INT_EN_MSK         (((1U << PDS_TOUCH_INT_EN_LEN) - 1) << PDS_TOUCH_INT_EN_POS)
#define PDS_TOUCH_INT_EN_UMSK        (~(((1U << PDS_TOUCH_INT_EN_LEN) - 1) << PDS_TOUCH_INT_EN_POS))

/* 0xAD0 : touch_int_status */
#define PDS_TOUCH_INT_STATUS_OFFSET (0xAD0)
#define PDS_TOUCH_INT_STATUS        PDS_TOUCH_INT_STATUS
#define PDS_TOUCH_INT_STATUS_POS    (0U)
#define PDS_TOUCH_INT_STATUS_LEN    (12U)
#define PDS_TOUCH_INT_STATUS_MSK    (((1U << PDS_TOUCH_INT_STATUS_LEN) - 1) << PDS_TOUCH_INT_STATUS_POS)
#define PDS_TOUCH_INT_STATUS_UMSK   (~(((1U << PDS_TOUCH_INT_STATUS_LEN) - 1) << PDS_TOUCH_INT_STATUS_POS))
#define PDS_TOUCH_END_FLAG          PDS_TOUCH_END_FLAG
#define PDS_TOUCH_END_FLAG_POS      (12U)
#define PDS_TOUCH_END_FLAG_LEN      (1U)
#define PDS_TOUCH_END_FLAG_MSK      (((1U << PDS_TOUCH_END_FLAG_LEN) - 1) << PDS_TOUCH_END_FLAG_POS)
#define PDS_TOUCH_END_FLAG_UMSK     (~(((1U << PDS_TOUCH_END_FLAG_LEN) - 1) << PDS_TOUCH_END_FLAG_POS))

struct pds_reg {
    /* 0x0 : PDS_CTL */
    union {
        struct {
            uint32_t pds_start_ps                 : 1; /* [    0],        w1p,        0x0 */
            uint32_t cr_sleep_forever             : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_xtal_force_off            : 1; /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_wifi_save_state       : 1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_pd_dcdc11             : 1; /* [    4],        r/w,        0x0 */
            uint32_t cr_pds_pd_bg_sys             : 1; /* [    5],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_gpio_ie_pu_pd    : 1; /* [    6],        r/w,        0x0 */
            uint32_t cr_pds_pd_dcdc18             : 1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gate_clk              : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_pds_mem_stby              : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_pds_glb_reg_reset_protect : 1; /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_iso_en                : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_pds_wait_xtal_rdy         : 1; /* [   12],        r/w,        0x0 */
            uint32_t cr_pds_pwr_off               : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_pd_xtal               : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_ctrl_soc_enb          : 1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_rst_soc               : 1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_rc32m_off_dis         : 1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_dcdc11_vsel_en        : 1; /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_usbpll_pd        : 1; /* [   19],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_aupll_pd         : 1; /* [   20],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_cpupll_pd        : 1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_wifipll_pd       : 1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_dcdc11_vol            : 5; /* [27:23],        r/w,        0x8 */
            uint32_t cr_pds_ctrl_rf               : 2; /* [29:28],        r/w,        0x1 */
            uint32_t cr_pds_start_use_tbtt_sleep  : 1; /* [   30],        r/w,        0x0 */
            uint32_t cr_pds_gpio_iso_mode         : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL;

