RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
    /* 0x34 : pds_gpio_pd_set */
    union {
        struct {
            uint32_t cr_pds_gpio_set_int_mask : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } pds_gpio_pd_set;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[8];

    /* 0x40 : pds_gpio_int */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t pds_gpio_set1_int_clr  : 1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3             : 1; /* [    3],       rsvd,        0x0 */
            uint32_t pds_gpio_set1_int_mode : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_9           : 2; /* [ 9: 8],       rsvd,        0x0 */
            uint32_t pds_gpio_set2_int_clr  : 1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11            : 1; /* [   11],       rsvd,        0x0 */
            uint32_t pds_gpio_set2_int_mode : 4; /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_17         : 2; /* [17:16],       rsvd,        0x0 */
            uint32_t pds_gpio_set3_int_clr  : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19            : 1; /* [   19],       rsvd,        0x0 */
            uint32_t pds_gpio_set3_int_mode : 4; /* [23:20],        r/w,        0x0 */
            uint32_t reserved_24_25         : 2; /* [25:24],       rsvd,        0x0 */
            uint32_t pds_gpio_set4_int_clr  : 1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27            : 1; /* [   27],       rsvd,        0x0 */
            uint32_t pds_gpio_set4_int_mode : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_gpio_int;

    /* 0x44 : pds_gpio_stat */
    union {
        struct {
            uint32_t pds_gpio_int_stat : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_gpio_stat;

    /* 0x48  reserved */
    uint8_t RESERVED0x48[200];

    /* 0x110 : cpu_core_cfg0 */
    union {
        struct {
            uint32_t reserved_0_27   : 28; /* [27: 0],       rsvd,        0x0 */
            uint32_t reg_pico_clk_en : 1;  /* [   28],        r/w,        0x0 */
            uint32_t e902_dfs_req    : 1;  /* [   29],        r/w,        0x0 */
            uint32_t e902_dfs_ack    : 1;  /* [   30],          r,        0x0 */
            uint32_t reserved_31     : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg0;

    /* 0x114 : cpu_core_cfg1 */
    union {
        struct {
            uint32_t reserved_0_3    : 4;  /* [ 3: 0],       rsvd,        0x0 */
            uint32_t reg_pll_sel     : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_7    : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_mcu1_clk_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31   : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg1;

    /* 0x118  reserved */
    uint8_t RESERVED0x118[20];

    /* 0x12C : cpu_core_cfg7 */
    union {
        struct {
            uint32_t reg_pico_div  : 8;  /* [ 7: 0],        r/w,        0x1 */
            uint32_t reserved_8_27 : 20; /* [27: 8],       rsvd,        0x0 */
            uint32_t e902_lpmd_b   : 2;  /* [29:28],          r,        0x0 */
            uint32_t reserved_30   : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t pico_rst_mask : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg7;

    /* 0x130 : cpu_core_cfg8 */
    union {
        struct {
            uint32_t e902_rtc_div   : 10; /* [ 9: 0],        r/w,        0xa */
            uint32_t reserved_10_29 : 20; /* [29:10],       rsvd,        0x0 */
            uint32_t e902_rtc_rst   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t e902_rtc_en    : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg8;

    /* 0x134 : cpu_core_cfg9 */
    union {
        struct {
            uint32_t pico_rtc_cnt_l : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg9;

    /* 0x138 : cpu_core_cfg10 */
    union {
        struct {
            uint32_t pico_rtc_cnt_h : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg10;

    /* 0x13c  reserved */
    uint8_t RESERVED0x13c[4];

    /* 0x140 : cpu_core_cfg12 */
    union {
        struct {
            uint32_t e902_iahbl_base : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t e902_iahbl_mask : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg12;

    /* 0x144 : cpu_core_cfg13 */
    union {
        struct {
            uint32_t e902_rst_addr : 32; /* [31: 0],        r/w, 0x22010000 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg13;

    /* 0x148 : cpu_core_cfg14 */
    union {
        struct {
            uint32_t e906_rst_addr : 32; /* [31: 0],        r/w, 0x90000000 */
        } BF;
        uint32_t WORD;
    } cpu_core_cfg14;

    /* 0x14C : tzc_pds */
    union {
        struct {
            uint32_t cr_e902_cfg_wr_lock : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_e906_cfg_wr_lock : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31       : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_pds;

    /* 0x150  reserved */
    uint8_t RESERVED0x150[432];

    /* 0x300 : rc32m_ctrl0 */
    union {
        struct {
            uint32_t rc32m_cal_done        : 1; /* [    0],          r,        0x0 */
            uint32_t rc32m_rdy             : 1; /* [    1],          r,        0x0 */
            uint32_t rc32m_cal_inprogress  : 1; /* [    2],          r,        0x0 */
            uint32_t rc32m_cal_div         : 2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32m_cal_precharge   : 1; /* [    5],          r,        0x0 */
            uint32_t rc32m_dig_code_fr_cal : 8; /* [13: 6],          r,        0x0 */
            uint32_t reserved_14_16        : 3; /* [16:14],       rsvd,        0x0 */
            uint32_t rc32m_allow_cal       : 1; /* [   17],        r/w,        0x0 */
            uint32_t rc32m_refclk_half     : 1; /* [   18],        r/w,        0x0 */
            uint32_t rc32m_ext_code_en     : 1; /* [   19],        r/w,        0x1 */
            uint32_t rc32m_cal_en          : 1; /* [   20],        r/w,        0x0 */
            uint32_t rc32m_pd              : 1; /* [   21],        r/w,        0x0 */
            uint32_t rc32m_code_fr_ext     : 8; /* [29:22],        r/w,       0x60 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl0;

