RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
    /* 0x304 : rc32m_ctrl1 */
    union {
        struct {
            uint32_t rc32m_test_en      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t rc32m_soft_rst     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rc32m_clk_soft_rst : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rc32m_clk_inv      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rc32m_clk_force_on : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_23      : 19; /* [23: 5],       rsvd,        0x0 */
            uint32_t rc32m_reserved     : 8;  /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl1;

    /* 0x308  reserved */
    uint8_t RESERVED0x308[248];

    /* 0x400 : pu_rst_clkpll */
    union {
        struct {
            uint32_t reserved_0_8           : 9;  /* [ 8: 0],       rsvd,        0x0 */
            uint32_t cr_pds_pu_clkpll_sfreg : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_pds_pu_clkpll       : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31         : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pu_rst_clkpll;

    /* 0x404  reserved */
    uint8_t RESERVED0x404[252];

    /* 0x500 : usb_ctl */
    union {
        struct {
            uint32_t reg_usb_sw_rst_n   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_usb_ext_susp_n : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_usb_wakeup     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_usb_l1_wakeup  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg_usb_drvbus_pol : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_usb_iddig      : 1;  /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_31      : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_ctl;

    /* 0x504 : usb_phy_ctrl */
    union {
        struct {
            uint32_t reg_usb_phy_ponrst    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_usb_phy_oscouten  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_usb_phy_xtlsel    : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_usb_phy_outclksel : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_usb_phy_pllaliv   : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reg_pu_usb20_psw      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_31         : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_phy_ctrl;

    /* 0x508  reserved */
    uint8_t RESERVED0x508[1272];

    /* 0xA00 : touch channel, clock, ana config1 */
    union {
        struct {
            uint32_t touch_vref_sel      : 3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t touch_vldo_sel      : 3; /* [ 5: 3],        r/w,        0x3 */
            uint32_t touch_comp_hys_sel  : 1; /* [    6],        r/w,        0x0 */
            uint32_t touch_current_sel   : 1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_15       : 8; /* [15: 8],       rsvd,        0x0 */
            uint32_t touch_clk_sel       : 1; /* [   16],        r/w,        0x1 */
            uint32_t touch_clk_div_ratio : 3; /* [19:17],        r/w,        0x1 */
            uint32_t touch_pcharge_high  : 3; /* [22:20],        r/w,        0x2 */
            uint32_t touch_pcharge_low   : 3; /* [25:23],        r/w,        0x1 */
            uint32_t touch_cont_en       : 1; /* [   26],        r/w,        0x0 */
            uint32_t touch_cycle_en      : 1; /* [   27],        r/w,        0x0 */
            uint32_t touch_ulp_en        : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29         : 1; /* [   29],       rsvd,        0x0 */
            uint32_t pu_touch            : 1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch1;

    /* 0xA04 : touch channel, clock, ana config2 */
    union {
        struct {
            uint32_t touch_channel_sel        : 4;  /* [ 3: 0],        r/w,        0x0 */
            uint32_t touch_channel0_highz_en  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t touch_channel1_highz_en  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t touch_channel2_highz_en  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t touch_channel3_highz_en  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t touch_channel4_highz_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t touch_channel5_highz_en  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t touch_channel6_highz_en  : 1;  /* [   10],        r/w,        0x1 */
            uint32_t touch_channel7_highz_en  : 1;  /* [   11],        r/w,        0x1 */
            uint32_t touch_channel8_highz_en  : 1;  /* [   12],        r/w,        0x1 */
            uint32_t touch_channel9_highz_en  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t touch_channel10_highz_en : 1;  /* [   14],        r/w,        0x1 */
            uint32_t touch_channel11_highz_en : 1;  /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_31           : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch2;

    /* 0xA08 : touch data process */
    union {
        struct {
            uint32_t touch_channel_cal_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t touch_force_value_en  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t touch_data_hys_en     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3            : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t touch_lta_en          : 1;  /* [    4],        r/w,        0x0 */
            uint32_t touch_lta_order       : 3;  /* [ 7: 5],        r/w,        0x3 */
            uint32_t touch_flt_en          : 1;  /* [    8],        r/w,        0x0 */
            uint32_t touch_flt_order       : 3;  /* [11: 9],        r/w,        0x3 */
            uint32_t touch_self_mutual_sel : 1;  /* [   12],        r/w,        0x0 */
            uint32_t touch_vldo_ccsel      : 2;  /* [14:13],        r/w,        0x0 */
            uint32_t reserved_15_17        : 3;  /* [17:15],       rsvd,        0x0 */
            uint32_t ten_touch             : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31        : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch3;

    /* 0xA0C : Touch_sleep_time */
    union {
        struct {
            uint32_t touch_sleep_cycle : 23; /* [22: 0],        r/w,    0x7ffff */
            uint32_t reserved_23_31    : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Touch_sleep_time;

    /* 0xA10 : touch_data_hystersis */
    union {
        struct {
            uint32_t touch_data_hys : 9;  /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_31  : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch_data_hystersis;

    /* 0xA14 : Channel_force_data_0 */
    union {
        struct {
            uint32_t touch_force_data_ch0 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch1 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_0;

    /* 0xA18 : Channel_force_data_1 */
    union {
        struct {
            uint32_t touch_force_data_ch2 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch3 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_1;

    /* 0xA1C : Channel_force_data_2 */
    union {
        struct {
            uint32_t touch_force_data_ch4 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch5 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_2;

    /* 0xA20 : Channel_force_data_3 */
    union {
        struct {
            uint32_t touch_force_data_ch6 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch7 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_3;

    /* 0xA24 : Channel_force_data_4 */
    union {
        struct {
            uint32_t touch_force_data_ch8 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch9 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_4;

    /* 0xA28 : Channel_force_data_5 */
    union {
        struct {
            uint32_t touch_force_data_ch10 : 16; /* [15: 0],        r/w,      0x400 */
            uint32_t touch_force_data_ch11 : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } Channel_force_data_5;

    /* 0xA2C : Channel_vth_data_0 */
    union {
        struct {
            uint32_t touch_vth_data_ch0 : 8; /* [ 7: 0],        r/w,       0x3f */
            uint32_t touch_vth_data_ch1 : 8; /* [15: 8],        r/w,       0x3f */
            uint32_t touch_vth_data_ch2 : 8; /* [23:16],        r/w,       0x3f */
            uint32_t touch_vth_data_ch3 : 8; /* [31:24],        r/w,       0x3f */
        } BF;
        uint32_t WORD;
    } Channel_vth_data_0;

