RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/pds_reg.h
    /* 0xA84 : Channel_LTA_data_7 */
    union {
        struct {
            uint32_t touch_lta_data_ch7 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_7;

    /* 0xA88 : Channel_LTA_data_8 */
    union {
        struct {
            uint32_t touch_lta_data_ch8 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_8;

    /* 0xA8C : Channel_LTA_data_9 */
    union {
        struct {
            uint32_t touch_lta_data_ch9 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_9;

    /* 0xA90 : Channel_LTA_data_10 */
    union {
        struct {
            uint32_t touch_lta_data_ch10 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_10;

    /* 0xA94 : Channel_LTA_data_11 */
    union {
        struct {
            uint32_t touch_lta_data_ch11 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_11;

    /* 0xA98 : Channel_FLT_data_0 */
    union {
        struct {
            uint32_t touch_flt_data_ch0 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_0;

    /* 0xA9C : Channel_FLT_data_1 */
    union {
        struct {
            uint32_t touch_flt_data_ch1 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_1;

    /* 0xAA0 : Channel_FLT_data_2 */
    union {
        struct {
            uint32_t touch_flt_data_ch2 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_2;

    /* 0xAA4 : Channel_FLT_data_3 */
    union {
        struct {
            uint32_t touch_flt_data_ch3 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_3;

    /* 0xAA8 : Channel_FLT_data_4 */
    union {
        struct {
            uint32_t touch_flt_data_ch4 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_4;

    /* 0xAAC : Channel_FLT_data_5 */
    union {
        struct {
            uint32_t touch_flt_data_ch5 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_5;

    /* 0xAB0 : Channel_FLT_data_6 */
    union {
        struct {
            uint32_t touch_flt_data_ch6 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_6;

    /* 0xAB4 : Channel_FLT_data_7 */
    union {
        struct {
            uint32_t touch_flt_data_ch7 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_7;

    /* 0xAB8 : Channel_FLT_data_8 */
    union {
        struct {
            uint32_t touch_flt_data_ch8 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_8;

    /* 0xABC : Channel_FLT_data_9 */
    union {
        struct {
            uint32_t touch_flt_data_ch9 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_9;

    /* 0xAC0 : Channel_FLT_data_10 */
    union {
        struct {
            uint32_t touch_flt_data_ch10 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_10;

    /* 0xAC4 : Channel_FLT_data_11 */
    union {
        struct {
            uint32_t touch_flt_data_ch11 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_FLT_data_11;

    /* 0xAC8 : touch_rsvd */
    union {
        struct {
            uint32_t touch_reserved : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31  : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch_rsvd;

    /* 0xACC : touch_int_setting */
    union {
        struct {
            uint32_t touch_int_clr  : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t touch_int_mask : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_30 : 3;  /* [30:28],       rsvd,        0x0 */
            uint32_t touch_int_en   : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } touch_int_setting;

    /* 0xAD0 : touch_int_status */
    union {
        struct {
            uint32_t touch_int_status : 12; /* [11: 0],          R,        0x0 */
            uint32_t touch_end_flag   : 1;  /* [   12],          R,        0x0 */
            uint32_t reserved_13_31   : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } touch_int_status;
};

typedef volatile struct pds_reg pds_reg_t;

#endif /* __PDS_REG_H__ */
